ndis_types = {
  'LIST_ENTRY64' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  'LIST_ENTRY32' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_LIST_ENTRY' : [ 0x8, {
    'Flink' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'Blink' : [ 0x4, ['pointer', ['_LIST_ENTRY']]],
} ],
  '_IMAGE_NT_HEADERS' : [ 0xf8, {
    'Signature' : [ 0x0, ['unsigned long']],
    'FileHeader' : [ 0x4, ['_IMAGE_FILE_HEADER']],
    'OptionalHeader' : [ 0x18, ['_IMAGE_OPTIONAL_HEADER']],
} ],
  '__unnamed_1016' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_LARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
    'u' : [ 0x0, ['__unnamed_1016']],
    'QuadPart' : [ 0x0, ['long long']],
} ],
  '__unnamed_101b' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
} ],
  '_ULARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
    'u' : [ 0x0, ['__unnamed_101b']],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '_LUID' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_SLIST_HEADER' : [ 0x8, {
    'Alignment' : [ 0x0, ['unsigned long long']],
    'Next' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x4, ['unsigned short']],
    'Sequence' : [ 0x6, ['unsigned short']],
} ],
  '_NPAGED_LOOKASIDE_LIST' : [ 0x50, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
    'Lock__ObsoleteButDoNotDelete' : [ 0x48, ['unsigned long']],
} ],
  '_PAGED_LOOKASIDE_LIST' : [ 0x68, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
    'Lock__ObsoleteButDoNotDelete' : [ 0x48, ['_FAST_MUTEX']],
} ],
  '_EX_RUNDOWN_REF' : [ 0x4, {
    'Count' : [ 0x0, ['unsigned long']],
    'Ptr' : [ 0x0, ['pointer', ['void']]],
} ],
  '_EX_PUSH_LOCK' : [ 0x4, {
#    'Waiting' : [ 0x0, [UNIMPLEMENTED LF_BITFIELD]],
#    'Exclusive' : [ 0x0, [UNIMPLEMENTED LF_BITFIELD]],
#    'Shared' : [ 0x0, [UNIMPLEMENTED LF_BITFIELD]],
    'Value' : [ 0x0, ['unsigned long']],
    'Ptr' : [ 0x0, ['pointer', ['void']]],
} ],
  '_EX_PUSH_LOCK_CACHE_AWARE' : [ 0x80, {
    'Locks' : [ 0x0, ['array', 32, ['pointer', ['_EX_PUSH_LOCK']]]],
} ],
  '_OBJECT_ATTRIBUTES' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'RootDirectory' : [ 0x4, ['pointer', ['void']]],
    'ObjectName' : [ 0x8, ['pointer', ['_UNICODE_STRING']]],
    'Attributes' : [ 0xc, ['unsigned long']],
    'SecurityDescriptor' : [ 0x10, ['pointer', ['void']]],
    'SecurityQualityOfService' : [ 0x14, ['pointer', ['void']]],
} ],
  '_OBJECT_TYPE' : [ 0x190, {
    'Mutex' : [ 0x0, ['_ERESOURCE']],
    'TypeList' : [ 0x38, ['_LIST_ENTRY']],
    'Name' : [ 0x40, ['_UNICODE_STRING']],
    'DefaultObject' : [ 0x48, ['pointer', ['void']]],
    'Index' : [ 0x4c, ['unsigned long']],
    'TotalNumberOfObjects' : [ 0x50, ['unsigned long']],
    'TotalNumberOfHandles' : [ 0x54, ['unsigned long']],
    'HighWaterNumberOfObjects' : [ 0x58, ['unsigned long']],
    'HighWaterNumberOfHandles' : [ 0x5c, ['unsigned long']],
    'TypeInfo' : [ 0x60, ['_OBJECT_TYPE_INITIALIZER']],
    'Key' : [ 0xac, ['unsigned long']],
    'ObjectLocks' : [ 0xb0, ['array', 4, ['_ERESOURCE']]],
} ],
  '_OBJECT_HANDLE_INFORMATION' : [ 0x8, {
    'HandleAttributes' : [ 0x0, ['unsigned long']],
    'GrantedAccess' : [ 0x4, ['unsigned long']],
} ],
  '_MDL' : [ 0x1c, {
    'Next' : [ 0x0, ['pointer', ['_MDL']]],
    'Size' : [ 0x4, ['short']],
    'MdlFlags' : [ 0x6, ['short']],
    'Process' : [ 0x8, ['pointer', ['_EPROCESS']]],
    'MappedSystemVa' : [ 0xc, ['pointer', ['void']]],
    'StartVa' : [ 0x10, ['pointer', ['void']]],
    'ByteCount' : [ 0x14, ['unsigned long']],
    'ByteOffset' : [ 0x18, ['unsigned long']],
} ],
  '_NDIS_PACKET' : [ 0x3c, {
    'Private' : [ 0x0, ['_NDIS_PACKET_PRIVATE']],
    'MiniportReserved' : [ 0x20, ['array', 8, ['unsigned char']]],
    'WrapperReserved' : [ 0x28, ['array', 8, ['unsigned char']]],
    'MiniportReservedEx' : [ 0x20, ['array', 12, ['unsigned char']]],
    'WrapperReservedEx' : [ 0x2c, ['array', 4, ['unsigned char']]],
    'MacReserved' : [ 0x20, ['array', 16, ['unsigned char']]],
    'Reserved' : [ 0x30, ['array', 2, ['unsigned long']]],
    'ProtocolReserved' : [ 0x38, ['array', 1, ['unsigned char']]],
} ],
  '_KSGATE' : [ 0x8, {
    'Count' : [ 0x0, ['long']],
    'NextGate' : [ 0x4, ['pointer', ['_KSGATE']]],
} ],
  '_KSEVENT_ENTRY' : [ 0x30, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Object' : [ 0x8, ['pointer', ['void']]],
    'DpcItem' : [ 0xc, ['pointer', ['KSDPC_ITEM']]],
    'BufferItem' : [ 0xc, ['pointer', ['KSBUFFER_ITEM']]],
    'EventData' : [ 0x10, ['pointer', ['KSEVENTDATA']]],
    'NotificationType' : [ 0x14, ['unsigned long']],
    'EventSet' : [ 0x18, ['pointer', ['KSEVENT_SET']]],
    'EventItem' : [ 0x1c, ['pointer', ['KSEVENT_ITEM']]],
    'FileObject' : [ 0x20, ['pointer', ['_FILE_OBJECT']]],
    'SemaphoreAdjustment' : [ 0x24, ['unsigned long']],
    'Reserved' : [ 0x28, ['unsigned long']],
    'Flags' : [ 0x2c, ['unsigned long']],
} ],
  '_KSFILTER' : [ 0xc, {
    'Descriptor' : [ 0x0, ['pointer', ['_KSFILTER_DESCRIPTOR']]],
    'Bag' : [ 0x4, ['pointer', ['void']]],
    'Context' : [ 0x8, ['pointer', ['void']]],
} ],
  '_KSPIN' : [ 0x70, {
    'Descriptor' : [ 0x0, ['pointer', ['_KSPIN_DESCRIPTOR_EX']]],
    'Bag' : [ 0x4, ['pointer', ['void']]],
    'Context' : [ 0x8, ['pointer', ['void']]],
    'Id' : [ 0xc, ['unsigned long']],
#    'Communication' : [ 0x10, [UNIMPLEMENTED LF_ENUM]],
    'ConnectionIsExternal' : [ 0x14, ['unsigned char']],
    'ConnectionInterface' : [ 0x18, ['KSIDENTIFIER']],
    'ConnectionMedium' : [ 0x30, ['KSIDENTIFIER']],
    'ConnectionPriority' : [ 0x48, ['KSPRIORITY']],
    'ConnectionFormat' : [ 0x50, ['pointer', ['KSDATAFORMAT']]],
    'AttributeList' : [ 0x54, ['pointer', ['KSMULTIPLE_ITEM']]],
    'StreamHeaderSize' : [ 0x58, ['unsigned long']],
#    'DataFlow' : [ 0x5c, [UNIMPLEMENTED LF_ENUM]],
#    'DeviceState' : [ 0x60, [UNIMPLEMENTED LF_ENUM]],
#    'ResetState' : [ 0x64, [UNIMPLEMENTED LF_ENUM]],
#    'ClientState' : [ 0x68, [UNIMPLEMENTED LF_ENUM]],
} ],
  '_GUID' : [ 0x10, {
    'Data1' : [ 0x0, ['unsigned long']],
    'Data2' : [ 0x4, ['unsigned short']],
    'Data3' : [ 0x6, ['unsigned short']],
    'Data4' : [ 0x8, ['array', 8, ['unsigned char']]],
} ],
  '_FILE_OBJECT' : [ 0x70, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'Vpb' : [ 0x8, ['pointer', ['_VPB']]],
    'FsContext' : [ 0xc, ['pointer', ['void']]],
    'FsContext2' : [ 0x10, ['pointer', ['void']]],
    'SectionObjectPointer' : [ 0x14, ['pointer', ['_SECTION_OBJECT_POINTERS']]],
    'PrivateCacheMap' : [ 0x18, ['pointer', ['void']]],
    'FinalStatus' : [ 0x1c, ['long']],
    'RelatedFileObject' : [ 0x20, ['pointer', ['_FILE_OBJECT']]],
    'LockOperation' : [ 0x24, ['unsigned char']],
    'DeletePending' : [ 0x25, ['unsigned char']],
    'ReadAccess' : [ 0x26, ['unsigned char']],
    'WriteAccess' : [ 0x27, ['unsigned char']],
    'DeleteAccess' : [ 0x28, ['unsigned char']],
    'SharedRead' : [ 0x29, ['unsigned char']],
    'SharedWrite' : [ 0x2a, ['unsigned char']],
    'SharedDelete' : [ 0x2b, ['unsigned char']],
    'Flags' : [ 0x2c, ['unsigned long']],
    'FileName' : [ 0x30, ['_UNICODE_STRING']],
    'CurrentByteOffset' : [ 0x38, ['_LARGE_INTEGER']],
    'Waiters' : [ 0x40, ['unsigned long']],
    'Busy' : [ 0x44, ['unsigned long']],
    'LastLock' : [ 0x48, ['pointer', ['void']]],
    'Lock' : [ 0x4c, ['_KEVENT']],
    'Event' : [ 0x5c, ['_KEVENT']],
    'CompletionContext' : [ 0x6c, ['pointer', ['_IO_COMPLETION_CONTEXT']]],
} ],
  '_KSFILTERFACTORY' : [ 0xc, {
    'FilterDescriptor' : [ 0x0, ['pointer', ['_KSFILTER_DESCRIPTOR']]],
    'Bag' : [ 0x4, ['pointer', ['void']]],
    'Context' : [ 0x8, ['pointer', ['void']]],
} ],
  '_KSDEVICE' : [ 0x24, {
    'Descriptor' : [ 0x0, ['pointer', ['_KSDEVICE_DESCRIPTOR']]],
    'Bag' : [ 0x4, ['pointer', ['void']]],
    'Context' : [ 0x8, ['pointer', ['void']]],
    'FunctionalDeviceObject' : [ 0xc, ['pointer', ['_DEVICE_OBJECT']]],
    'PhysicalDeviceObject' : [ 0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'NextDeviceObject' : [ 0x14, ['pointer', ['_DEVICE_OBJECT']]],
    'Started' : [ 0x18, ['unsigned char']],
#    'SystemPowerState' : [ 0x1c, [UNIMPLEMENTED LF_ENUM]],
#    'DevicePowerState' : [ 0x20, [UNIMPLEMENTED LF_ENUM]],
} ],
  '_NDIS_PACKET_STACK' : [ 0x18, {
    'IMReserved' : [ 0x0, ['array', 2, ['unsigned long']]],
    'NdisReserved' : [ 0x8, ['array', 4, ['unsigned long']]],
} ],
  '_KSFILTER_DESCRIPTOR' : [ 0x40, {
    'Dispatch' : [ 0x0, ['pointer', ['_KSFILTER_DISPATCH']]],
    'AutomationTable' : [ 0x4, ['pointer', ['KSAUTOMATION_TABLE_']]],
    'Version' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['unsigned long']],
    'ReferenceGuid' : [ 0x10, ['pointer', ['_GUID']]],
    'PinDescriptorsCount' : [ 0x14, ['unsigned long']],
    'PinDescriptorSize' : [ 0x18, ['unsigned long']],
    'PinDescriptors' : [ 0x1c, ['pointer', ['_KSPIN_DESCRIPTOR_EX']]],
    'CategoriesCount' : [ 0x20, ['unsigned long']],
    'Categories' : [ 0x24, ['pointer', ['_GUID']]],
    'NodeDescriptorsCount' : [ 0x28, ['unsigned long']],
    'NodeDescriptorSize' : [ 0x2c, ['unsigned long']],
    'NodeDescriptors' : [ 0x30, ['pointer', ['_KSNODE_DESCRIPTOR']]],
    'ConnectionsCount' : [ 0x34, ['unsigned long']],
    'Connections' : [ 0x38, ['pointer', ['KSTOPOLOGY_CONNECTION']]],
    'ComponentId' : [ 0x3c, ['pointer', ['KSCOMPONENTID']]],
} ],
  'KSTOPOLOGY_CONNECTION' : [ 0x10, {
    'FromNode' : [ 0x0, ['unsigned long']],
    'FromNodePin' : [ 0x4, ['unsigned long']],
    'ToNode' : [ 0x8, ['unsigned long']],
    'ToNodePin' : [ 0xc, ['unsigned long']],
} ],
  '_NDIS_PKT_POOL' : [ 0x48, {
    'Tag' : [ 0x0, ['unsigned long']],
    'PacketLength' : [ 0x4, ['unsigned short']],
    'PktsPerBlock' : [ 0x6, ['unsigned short']],
    'MaxBlocks' : [ 0x8, ['unsigned short']],
    'StackSize' : [ 0xa, ['unsigned short']],
    'BlocksAllocated' : [ 0xc, ['long']],
    'ProtocolId' : [ 0x10, ['unsigned long']],
    'BlockSize' : [ 0x14, ['unsigned long']],
    'Allocator' : [ 0x18, ['pointer', ['void']]],
    'Lock' : [ 0x1c, ['unsigned long']],
    'FreeBlocks' : [ 0x20, ['_LIST_ENTRY']],
    'UsedBlocks' : [ 0x28, ['_LIST_ENTRY']],
    'AgingBlocks' : [ 0x30, ['_LIST_ENTRY']],
    'GlobalPacketPoolList' : [ 0x38, ['_LIST_ENTRY']],
    'NextScavengeTick' : [ 0x40, ['_LARGE_INTEGER']],
} ],
  '_UNICODE_STRING' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x4, ['pointer', ['unsigned short']]],
} ],
  '_FAST_MUTEX' : [ 0x20, {
    'Count' : [ 0x0, ['long']],
    'Owner' : [ 0x4, ['pointer', ['_KTHREAD']]],
    'Contention' : [ 0x8, ['unsigned long']],
    'Event' : [ 0xc, ['_KEVENT']],
    'OldIrql' : [ 0x1c, ['unsigned long']],
} ],
  '_IMAGE_FILE_HEADER' : [ 0x14, {
    'Machine' : [ 0x0, ['unsigned short']],
    'NumberOfSections' : [ 0x2, ['unsigned short']],
    'TimeDateStamp' : [ 0x4, ['unsigned long']],
    'PointerToSymbolTable' : [ 0x8, ['unsigned long']],
    'NumberOfSymbols' : [ 0xc, ['unsigned long']],
    'SizeOfOptionalHeader' : [ 0x10, ['unsigned short']],
    'Characteristics' : [ 0x12, ['unsigned short']],
} ],
  '_GENERAL_LOOKASIDE' : [ 0x48, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'Depth' : [ 0x8, ['unsigned short']],
    'MaximumDepth' : [ 0xa, ['unsigned short']],
    'TotalAllocates' : [ 0xc, ['unsigned long']],
    'AllocateMisses' : [ 0x10, ['unsigned long']],
    'AllocateHits' : [ 0x10, ['unsigned long']],
    'TotalFrees' : [ 0x14, ['unsigned long']],
    'FreeMisses' : [ 0x18, ['unsigned long']],
    'FreeHits' : [ 0x18, ['unsigned long']],
#    'Type' : [ 0x1c, [UNIMPLEMENTED LF_ENUM]],
    'Tag' : [ 0x20, ['unsigned long']],
    'Size' : [ 0x24, ['unsigned long']],
    'Allocate' : [ 0x28, ['pointer', ['void']]],
    'Free' : [ 0x2c, ['pointer', ['void']]],
    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x38, ['unsigned long']],
    'LastAllocateMisses' : [ 0x3c, ['unsigned long']],
    'LastAllocateHits' : [ 0x3c, ['unsigned long']],
    'Future' : [ 0x40, ['array', 2, ['unsigned long']]],
} ],
  '_IO_COMPLETION_CONTEXT' : [ 0x8, {
    'Port' : [ 0x0, ['pointer', ['void']]],
    'Key' : [ 0x4, ['pointer', ['void']]],
} ],
  '_SINGLE_LIST_ENTRY' : [ 0x4, {
    'Next' : [ 0x0, ['pointer', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_NDIS_M_DRIVER_BLOCK' : [ 0xdc, {
    'NextDriver' : [ 0x0, ['pointer', ['_NDIS_M_DRIVER_BLOCK']]],
    'MiniportQueue' : [ 0x4, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'NdisDriverInfo' : [ 0x8, ['pointer', ['_NDIS_WRAPPER_HANDLE']]],
    'AssociatedProtocol' : [ 0xc, ['pointer', ['_NDIS_PROTOCOL_BLOCK']]],
    'DeviceList' : [ 0x10, ['_LIST_ENTRY']],
    'PendingDeviceList' : [ 0x18, ['pointer', ['_NDIS_PENDING_IM_INSTANCE']]],
    'UnloadHandler' : [ 0x1c, ['pointer', ['void']]],
    'MiniportCharacteristics' : [ 0x20, ['_NDIS51_MINIPORT_CHARACTERISTICS']],
    'MiniportsRemovedEvent' : [ 0x9c, ['_KEVENT']],
    'Ref' : [ 0xac, ['_REFERENCE']],
    'Flags' : [ 0xb4, ['unsigned short']],
    'IMStartRemoveMutex' : [ 0xb8, ['_KMUTANT']],
    'DriverVersion' : [ 0xd8, ['unsigned long']],
} ],
  'KSAUTOMATION_TABLE_' : [ 0x28, {
    'PropertySetsCount' : [ 0x0, ['unsigned long']],
    'PropertyItemSize' : [ 0x4, ['unsigned long']],
    'PropertySets' : [ 0x8, ['pointer', ['KSPROPERTY_SET']]],
    'MethodSetsCount' : [ 0xc, ['unsigned long']],
    'MethodItemSize' : [ 0x10, ['unsigned long']],
    'MethodSets' : [ 0x14, ['pointer', ['KSMETHOD_SET']]],
    'EventSetsCount' : [ 0x18, ['unsigned long']],
    'EventItemSize' : [ 0x1c, ['unsigned long']],
    'EventSets' : [ 0x20, ['pointer', ['KSEVENT_SET']]],
    'Alignment' : [ 0x24, ['pointer', ['void']]],
} ],
  '_NDIS_PACKET_PRIVATE' : [ 0x20, {
    'PhysicalCount' : [ 0x0, ['unsigned long']],
    'TotalLength' : [ 0x4, ['unsigned long']],
    'Head' : [ 0x8, ['pointer', ['_MDL']]],
    'Tail' : [ 0xc, ['pointer', ['_MDL']]],
    'Pool' : [ 0x10, ['pointer', ['void']]],
    'Count' : [ 0x14, ['unsigned long']],
    'Flags' : [ 0x18, ['unsigned long']],
    'ValidCounts' : [ 0x1c, ['unsigned char']],
    'NdisPacketFlags' : [ 0x1d, ['unsigned char']],
    'NdisPacketOobOffset' : [ 0x1e, ['unsigned short']],
} ],
  '_REFERENCE' : [ 0x8, {
    'SpinLock' : [ 0x0, ['unsigned long']],
    'ReferenceCount' : [ 0x4, ['unsigned short']],
    'Closing' : [ 0x6, ['unsigned char']],
} ],
  '_NDIS_TRACK_MEM' : [ 0x18, {
    'List' : [ 0x0, ['_LIST_ENTRY']],
    'Tag' : [ 0x8, ['unsigned long']],
    'Length' : [ 0xc, ['unsigned long']],
    'Caller' : [ 0x10, ['pointer', ['void']]],
    'CallersCaller' : [ 0x14, ['pointer', ['void']]],
} ],
  '_KSFILTER_DISPATCH' : [ 0x10, {
    'Create' : [ 0x0, ['pointer', ['void']]],
    'Close' : [ 0x4, ['pointer', ['void']]],
    'Process' : [ 0x8, ['pointer', ['void']]],
    'Reset' : [ 0xc, ['pointer', ['void']]],
} ],
  'KSBUFFER_ITEM' : [ 0x30, {
    'DpcItem' : [ 0x0, ['KSDPC_ITEM']],
    'BufferList' : [ 0x28, ['_LIST_ENTRY']],
} ],
  'KSDPC_ITEM' : [ 0x28, {
    'Dpc' : [ 0x0, ['_KDPC']],
    'ReferenceCount' : [ 0x20, ['unsigned long']],
    'AccessLock' : [ 0x24, ['unsigned long']],
} ],
  'KSEVENT_SET' : [ 0xc, {
    'Set' : [ 0x0, ['pointer', ['_GUID']]],
    'EventsCount' : [ 0x4, ['unsigned long']],
    'EventItem' : [ 0x8, ['pointer', ['KSEVENT_ITEM']]],
} ],
  'KSEVENT_ITEM' : [ 0x18, {
    'EventId' : [ 0x0, ['unsigned long']],
    'DataInput' : [ 0x4, ['unsigned long']],
    'ExtraEntryData' : [ 0x8, ['unsigned long']],
    'AddHandler' : [ 0xc, ['pointer', ['void']]],
    'RemoveHandler' : [ 0x10, ['pointer', ['void']]],
    'SupportHandler' : [ 0x14, ['pointer', ['void']]],
} ],
  'KSMETHOD_SET' : [ 0x14, {
    'Set' : [ 0x0, ['pointer', ['_GUID']]],
    'MethodsCount' : [ 0x4, ['unsigned long']],
    'MethodItem' : [ 0x8, ['pointer', ['KSMETHOD_ITEM']]],
    'FastIoCount' : [ 0xc, ['unsigned long']],
    'FastIoTable' : [ 0x10, ['pointer', ['KSFASTMETHOD_ITEM']]],
} ],
  'KSFASTMETHOD_ITEM' : [ 0x8, {
    'MethodId' : [ 0x0, ['unsigned long']],
    'MethodHandler' : [ 0x4, ['pointer', ['void']]],
    'MethodSupported' : [ 0x4, ['unsigned char']],
} ],
  'KSMETHOD_ITEM' : [ 0x18, {
    'MethodId' : [ 0x0, ['unsigned long']],
    'MethodHandler' : [ 0x4, ['pointer', ['void']]],
    'MethodSupported' : [ 0x4, ['unsigned char']],
    'MinMethod' : [ 0x8, ['unsigned long']],
    'MinData' : [ 0xc, ['unsigned long']],
    'SupportHandler' : [ 0x10, ['pointer', ['void']]],
    'Flags' : [ 0x14, ['unsigned long']],
} ],
  'KSPROPERTY_SET' : [ 0x14, {
    'Set' : [ 0x0, ['pointer', ['_GUID']]],
    'PropertiesCount' : [ 0x4, ['unsigned long']],
    'PropertyItem' : [ 0x8, ['pointer', ['KSPROPERTY_ITEM']]],
    'FastIoCount' : [ 0xc, ['unsigned long']],
    'FastIoTable' : [ 0x10, ['pointer', ['KSFASTPROPERTY_ITEM']]],
} ],
  'KSFASTPROPERTY_ITEM' : [ 0x10, {
    'PropertyId' : [ 0x0, ['unsigned long']],
    'GetPropertyHandler' : [ 0x4, ['pointer', ['void']]],
    'GetSupported' : [ 0x4, ['unsigned char']],
    'SetPropertyHandler' : [ 0x8, ['pointer', ['void']]],
    'SetSupported' : [ 0x8, ['unsigned char']],
    'Reserved' : [ 0xc, ['unsigned long']],
} ],
  'KSPROPERTY_ITEM' : [ 0x28, {
    'PropertyId' : [ 0x0, ['unsigned long']],
    'GetPropertyHandler' : [ 0x4, ['pointer', ['void']]],
    'GetSupported' : [ 0x4, ['unsigned char']],
    'MinProperty' : [ 0x8, ['unsigned long']],
    'MinData' : [ 0xc, ['unsigned long']],
    'SetPropertyHandler' : [ 0x10, ['pointer', ['void']]],
    'SetSupported' : [ 0x10, ['unsigned char']],
    'Values' : [ 0x14, ['pointer', ['KSPROPERTY_VALUES']]],
    'RelationsCount' : [ 0x18, ['unsigned long']],
    'Relations' : [ 0x1c, ['pointer', ['KSIDENTIFIER']]],
    'SupportHandler' : [ 0x20, ['pointer', ['void']]],
    'SerializedSize' : [ 0x24, ['unsigned long']],
} ],
  'KSPROPERTY_VALUES' : [ 0x20, {
    'PropTypeSet' : [ 0x0, ['KSIDENTIFIER']],
    'MembersListCount' : [ 0x18, ['unsigned long']],
    'MembersList' : [ 0x1c, ['pointer', ['KSPROPERTY_MEMBERSLIST']]],
} ],
  'KSPROPERTY_MEMBERSLIST' : [ 0x14, {
    'MembersHeader' : [ 0x0, ['KSPROPERTY_MEMBERSHEADER']],
    'Members' : [ 0x10, ['pointer', ['void']]],
} ],
  'KSDATAFORMAT' : [ 0x40, {
    'FormatSize' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'SampleSize' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'MajorFormat' : [ 0x10, ['_GUID']],
    'SubFormat' : [ 0x20, ['_GUID']],
    'Specifier' : [ 0x30, ['_GUID']],
    'Alignment' : [ 0x0, ['long long']],
} ],
  'KSCOMPONENTID' : [ 0x48, {
    'Manufacturer' : [ 0x0, ['_GUID']],
    'Product' : [ 0x10, ['_GUID']],
    'Component' : [ 0x20, ['_GUID']],
    'Name' : [ 0x30, ['_GUID']],
    'Version' : [ 0x40, ['unsigned long']],
    'Revision' : [ 0x44, ['unsigned long']],
} ],
  '__unnamed_1172' : [ 0xc, {
    'Event' : [ 0x0, ['pointer', ['void']]],
    'Reserved' : [ 0x4, ['array', 2, ['unsigned long']]],
} ],
  '__unnamed_1174' : [ 0xc, {
    'Semaphore' : [ 0x0, ['pointer', ['void']]],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Adjustment' : [ 0x8, ['long']],
} ],
  '__unnamed_1176' : [ 0xc, {
    'Event' : [ 0x0, ['pointer', ['void']]],
    'Increment' : [ 0x4, ['long']],
    'Reserved' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1178' : [ 0xc, {
    'Semaphore' : [ 0x0, ['pointer', ['void']]],
    'Increment' : [ 0x4, ['long']],
    'Adjustment' : [ 0x8, ['long']],
} ],
  '__unnamed_117b' : [ 0xc, {
    'Dpc' : [ 0x0, ['pointer', ['_KDPC']]],
    'ReferenceCount' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1181' : [ 0xc, {
    'WorkQueueItem' : [ 0x0, ['pointer', ['_WORK_QUEUE_ITEM']]],
#    'WorkQueueType' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
    'Reserved' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1183' : [ 0xc, {
    'WorkQueueItem' : [ 0x0, ['pointer', ['_WORK_QUEUE_ITEM']]],
    'KsWorkerObject' : [ 0x4, ['pointer', ['void']]],
    'Reserved' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1185' : [ 0xc, {
    'Filter' : [ 0x0, ['pointer', ['_KSFILTER']]],
    'Reserved' : [ 0x4, ['array', 2, ['unsigned long']]],
} ],
  '__unnamed_1187' : [ 0xc, {
    'Pin' : [ 0x0, ['pointer', ['_KSPIN']]],
    'Reserved' : [ 0x4, ['array', 2, ['unsigned long']]],
} ],
  '__unnamed_118a' : [ 0xc, {
    'Unused' : [ 0x0, ['pointer', ['void']]],
    'Alignment' : [ 0x4, ['array', 2, ['long']]],
} ],
  'KSEVENTDATA' : [ 0x10, {
    'NotificationType' : [ 0x0, ['unsigned long']],
    'EventHandle' : [ 0x4, ['__unnamed_1172']],
    'SemaphoreHandle' : [ 0x4, ['__unnamed_1174']],
    'EventObject' : [ 0x4, ['__unnamed_1176']],
    'SemaphoreObject' : [ 0x4, ['__unnamed_1178']],
    'Dpc' : [ 0x4, ['__unnamed_117b']],
    'WorkItem' : [ 0x4, ['__unnamed_1181']],
    'KsWorkItem' : [ 0x4, ['__unnamed_1183']],
    'KsFilterProcessing' : [ 0x4, ['__unnamed_1185']],
    'KsPinProcessing' : [ 0x4, ['__unnamed_1187']],
    'Alignment' : [ 0x4, ['__unnamed_118a']],
} ],
  'KSPROPERTY_MEMBERSHEADER' : [ 0x10, {
    'MembersFlags' : [ 0x0, ['unsigned long']],
    'MembersSize' : [ 0x4, ['unsigned long']],
    'MembersCount' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['unsigned long']],
} ],
  'KSMULTIPLE_ITEM' : [ 0x8, {
    'Size' : [ 0x0, ['unsigned long']],
    'Count' : [ 0x4, ['unsigned long']],
} ],
  'KSIDENTIFIER' : [ 0x18, {
    'Set' : [ 0x0, ['_GUID']],
    'Id' : [ 0x10, ['unsigned long']],
    'Flags' : [ 0x14, ['unsigned long']],
    'Alignment' : [ 0x0, ['long long']],
} ],
  'KSPRIORITY' : [ 0x8, {
    'PriorityClass' : [ 0x0, ['unsigned long']],
    'PrioritySubClass' : [ 0x4, ['unsigned long']],
} ],
  '_IO_STATUS_BLOCK' : [ 0x8, {
    'Status' : [ 0x0, ['long']],
    'Pointer' : [ 0x0, ['pointer', ['void']]],
    'Information' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_1199' : [ 0xc, {
    'Start' : [ 0x0, ['_LARGE_INTEGER']],
    'Length' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_119b' : [ 0xc, {
    'Level' : [ 0x0, ['unsigned long']],
    'Vector' : [ 0x4, ['unsigned long']],
    'Affinity' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_119d' : [ 0xc, {
    'Channel' : [ 0x0, ['unsigned long']],
    'Port' : [ 0x4, ['unsigned long']],
    'Reserved1' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_11a0' : [ 0xc, {
    'Data' : [ 0x0, ['array', 3, ['unsigned long']]],
} ],
  '__unnamed_11a2' : [ 0xc, {
    'Start' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_11a4' : [ 0xc, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'Reserved1' : [ 0x4, ['unsigned long']],
    'Reserved2' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_11a6' : [ 0xc, {
    'Generic' : [ 0x0, ['__unnamed_1199']],
    'Port' : [ 0x0, ['__unnamed_1199']],
    'Interrupt' : [ 0x0, ['__unnamed_119b']],
    'Memory' : [ 0x0, ['__unnamed_1199']],
    'Dma' : [ 0x0, ['__unnamed_119d']],
    'DevicePrivate' : [ 0x0, ['__unnamed_11a0']],
    'BusNumber' : [ 0x0, ['__unnamed_11a2']],
    'DeviceSpecificData' : [ 0x0, ['__unnamed_11a4']],
} ],
  '_CM_PARTIAL_RESOURCE_DESCRIPTOR' : [ 0x10, {
    'Type' : [ 0x0, ['unsigned char']],
    'ShareDisposition' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned short']],
    'u' : [ 0x4, ['__unnamed_11a6']],
} ],
  '_KSDEVICE_DESCRIPTOR' : [ 0x10, {
    'Dispatch' : [ 0x0, ['pointer', ['_KSDEVICE_DISPATCH']]],
    'FilterDescriptorsCount' : [ 0x4, ['unsigned long']],
    'FilterDescriptors' : [ 0x8, ['pointer', ['pointer', ['_KSFILTER_DESCRIPTOR']]]],
    'Version' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_11b6' : [ 0x28, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Wcb' : [ 0x0, ['_WAIT_CONTEXT_BLOCK']],
} ],
  '_DEVICE_OBJECT' : [ 0xb8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'ReferenceCount' : [ 0x4, ['long']],
    'DriverObject' : [ 0x8, ['pointer', ['_DRIVER_OBJECT']]],
    'NextDevice' : [ 0xc, ['pointer', ['_DEVICE_OBJECT']]],
    'AttachedDevice' : [ 0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'CurrentIrp' : [ 0x14, ['pointer', ['_IRP']]],
    'Timer' : [ 0x18, ['pointer', ['_IO_TIMER']]],
    'Flags' : [ 0x1c, ['unsigned long']],
    'Characteristics' : [ 0x20, ['unsigned long']],
    'Vpb' : [ 0x24, ['pointer', ['_VPB']]],
    'DeviceExtension' : [ 0x28, ['pointer', ['void']]],
    'DeviceType' : [ 0x2c, ['unsigned long']],
    'StackSize' : [ 0x30, ['unsigned char']],
    'Queue' : [ 0x34, ['__unnamed_11b6']],
    'AlignmentRequirement' : [ 0x5c, ['unsigned long']],
    'DeviceQueue' : [ 0x60, ['_KDEVICE_QUEUE']],
    'Dpc' : [ 0x74, ['_KDPC']],
    'ActiveThreadCount' : [ 0x94, ['unsigned long']],
    'SecurityDescriptor' : [ 0x98, ['pointer', ['void']]],
    'DeviceLock' : [ 0x9c, ['_KEVENT']],
    'SectorSize' : [ 0xac, ['unsigned short']],
    'Spare1' : [ 0xae, ['unsigned short']],
    'DeviceObjectExtension' : [ 0xb0, ['pointer', ['_DEVOBJ_EXTENSION']]],
    'Reserved' : [ 0xb4, ['pointer', ['void']]],
} ],
  '_SECTION_OBJECT_POINTERS' : [ 0xc, {
    'DataSectionObject' : [ 0x0, ['pointer', ['void']]],
    'SharedCacheMap' : [ 0x4, ['pointer', ['void']]],
    'ImageSectionObject' : [ 0x8, ['pointer', ['void']]],
} ],
  '_NDIS_PROTOCOL_BLOCK' : [ 0xc4, {
    'OpenQueue' : [ 0x0, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'Ref' : [ 0x4, ['_REFERENCE']],
    'DeregEvent' : [ 0xc, ['pointer', ['_KEVENT']]],
    'NextProtocol' : [ 0x10, ['pointer', ['_NDIS_PROTOCOL_BLOCK']]],
    'ProtocolCharacteristics' : [ 0x14, ['_NDIS50_PROTOCOL_CHARACTERISTICS']],
    'WorkItem' : [ 0x80, ['_WORK_QUEUE_ITEM']],
    'Mutex' : [ 0x90, ['_KMUTANT']],
    'MutexOwner' : [ 0xb0, ['unsigned long']],
    'BindDeviceName' : [ 0xb4, ['pointer', ['_UNICODE_STRING']]],
    'RootDeviceName' : [ 0xb8, ['pointer', ['_UNICODE_STRING']]],
    'AssociatedMiniDriver' : [ 0xbc, ['pointer', ['_NDIS_M_DRIVER_BLOCK']]],
    'BindingAdapter' : [ 0xc0, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
} ],
  '_KDEVICE_QUEUE' : [ 0x14, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceListHead' : [ 0x4, ['_LIST_ENTRY']],
    'Lock' : [ 0xc, ['unsigned long']],
    'Busy' : [ 0x10, ['unsigned char']],
} ],
  '_STACK_INDEX' : [ 0x8, {
    'Alignment' : [ 0x0, ['unsigned long long']],
    'XferDataIndex' : [ 0x0, ['unsigned long']],
    'Index' : [ 0x4, ['unsigned long']],
} ],
  '_OBJECT_TYPE_INITIALIZER' : [ 0x4c, {
    'Length' : [ 0x0, ['unsigned short']],
    'UseDefaultObject' : [ 0x2, ['unsigned char']],
    'CaseInsensitive' : [ 0x3, ['unsigned char']],
    'InvalidAttributes' : [ 0x4, ['unsigned long']],
    'GenericMapping' : [ 0x8, ['_GENERIC_MAPPING']],
    'ValidAccessMask' : [ 0x18, ['unsigned long']],
    'SecurityRequired' : [ 0x1c, ['unsigned char']],
    'MaintainHandleCount' : [ 0x1d, ['unsigned char']],
    'MaintainTypeList' : [ 0x1e, ['unsigned char']],
#    'PoolType' : [ 0x20, [UNIMPLEMENTED LF_ENUM]],
    'DefaultPagedPoolCharge' : [ 0x24, ['unsigned long']],
    'DefaultNonPagedPoolCharge' : [ 0x28, ['unsigned long']],
    'DumpProcedure' : [ 0x2c, ['pointer', ['void']]],
    'OpenProcedure' : [ 0x30, ['pointer', ['void']]],
    'CloseProcedure' : [ 0x34, ['pointer', ['void']]],
    'DeleteProcedure' : [ 0x38, ['pointer', ['void']]],
    'ParseProcedure' : [ 0x3c, ['pointer', ['void']]],
    'SecurityProcedure' : [ 0x40, ['pointer', ['void']]],
    'QueryNameProcedure' : [ 0x44, ['pointer', ['void']]],
    'OkayToCloseProcedure' : [ 0x48, ['pointer', ['void']]],
} ],
  '_NDIS_PENDING_IM_INSTANCE' : [ 0x10, {
    'Next' : [ 0x0, ['pointer', ['_NDIS_PENDING_IM_INSTANCE']]],
    'Context' : [ 0x4, ['pointer', ['void']]],
    'Name' : [ 0x8, ['_UNICODE_STRING']],
} ],
  '_WORK_QUEUE_ITEM' : [ 0x10, {
    'List' : [ 0x0, ['_LIST_ENTRY']],
    'WorkerRoutine' : [ 0x8, ['pointer', ['void']]],
    'Parameter' : [ 0xc, ['pointer', ['void']]],
} ],
  '_ERESOURCE' : [ 0x38, {
    'SystemResourcesList' : [ 0x0, ['_LIST_ENTRY']],
    'OwnerTable' : [ 0x8, ['pointer', ['_OWNER_ENTRY']]],
    'ActiveCount' : [ 0xc, ['short']],
    'Flag' : [ 0xe, ['unsigned short']],
    'SharedWaiters' : [ 0x10, ['pointer', ['_KSEMAPHORE']]],
    'ExclusiveWaiters' : [ 0x14, ['pointer', ['_KEVENT']]],
    'OwnerThreads' : [ 0x18, ['array', 2, ['_OWNER_ENTRY']]],
    'ContentionCount' : [ 0x28, ['unsigned long']],
    'NumberOfSharedWaiters' : [ 0x2c, ['unsigned short']],
    'NumberOfExclusiveWaiters' : [ 0x2e, ['unsigned short']],
    'Address' : [ 0x30, ['pointer', ['void']]],
    'CreatorBackTraceIndex' : [ 0x30, ['unsigned long']],
    'SpinLock' : [ 0x34, ['unsigned long']],
} ],
  '_VPB' : [ 0x58, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'Flags' : [ 0x4, ['unsigned short']],
    'VolumeLabelLength' : [ 0x6, ['unsigned short']],
    'DeviceObject' : [ 0x8, ['pointer', ['_DEVICE_OBJECT']]],
    'RealDevice' : [ 0xc, ['pointer', ['_DEVICE_OBJECT']]],
    'SerialNumber' : [ 0x10, ['unsigned long']],
    'ReferenceCount' : [ 0x14, ['unsigned long']],
    'VolumeLabel' : [ 0x18, ['array', 32, ['unsigned short']]],
} ],
  '_GENERIC_MAPPING' : [ 0x10, {
    'GenericRead' : [ 0x0, ['unsigned long']],
    'GenericWrite' : [ 0x4, ['unsigned long']],
    'GenericExecute' : [ 0x8, ['unsigned long']],
    'GenericAll' : [ 0xc, ['unsigned long']],
} ],
  '_DEVICE_CAPABILITIES' : [ 0x40, {
    'Size' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned short']],
#    'DeviceD1' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'DeviceD2' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'LockSupported' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'EjectSupported' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'Removable' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'DockDevice' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'UniqueID' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'SilentInstall' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'RawDeviceOK' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'SurpriseRemovalOK' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'WakeFromD0' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'WakeFromD1' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'WakeFromD2' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'WakeFromD3' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'HardwareDisabled' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'NonDynamic' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'WarmEjectSupported' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'NoDisplayInUI' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
#    'Reserved' : [ 0x4, [UNIMPLEMENTED LF_BITFIELD]],
    'Address' : [ 0x8, ['unsigned long']],
    'UINumber' : [ 0xc, ['unsigned long']],
#    'DeviceState' : [ 0x10, ['array', -28, [UNIMPLEMENTED LF_ENUM]]],
#    'SystemWake' : [ 0x2c, [UNIMPLEMENTED LF_ENUM]],
#    'DeviceWake' : [ 0x30, [UNIMPLEMENTED LF_ENUM]],
    'D1Latency' : [ 0x34, ['unsigned long']],
    'D2Latency' : [ 0x38, ['unsigned long']],
    'D3Latency' : [ 0x3c, ['unsigned long']],
} ],
  '_IMAGE_OPTIONAL_HEADER' : [ 0xe0, {
    'Magic' : [ 0x0, ['unsigned short']],
    'MajorLinkerVersion' : [ 0x2, ['unsigned char']],
    'MinorLinkerVersion' : [ 0x3, ['unsigned char']],
    'SizeOfCode' : [ 0x4, ['unsigned long']],
    'SizeOfInitializedData' : [ 0x8, ['unsigned long']],
    'SizeOfUninitializedData' : [ 0xc, ['unsigned long']],
    'AddressOfEntryPoint' : [ 0x10, ['unsigned long']],
    'BaseOfCode' : [ 0x14, ['unsigned long']],
    'BaseOfData' : [ 0x18, ['unsigned long']],
    'ImageBase' : [ 0x1c, ['unsigned long']],
    'SectionAlignment' : [ 0x20, ['unsigned long']],
    'FileAlignment' : [ 0x24, ['unsigned long']],
    'MajorOperatingSystemVersion' : [ 0x28, ['unsigned short']],
    'MinorOperatingSystemVersion' : [ 0x2a, ['unsigned short']],
    'MajorImageVersion' : [ 0x2c, ['unsigned short']],
    'MinorImageVersion' : [ 0x2e, ['unsigned short']],
    'MajorSubsystemVersion' : [ 0x30, ['unsigned short']],
    'MinorSubsystemVersion' : [ 0x32, ['unsigned short']],
    'Win32VersionValue' : [ 0x34, ['unsigned long']],
    'SizeOfImage' : [ 0x38, ['unsigned long']],
    'SizeOfHeaders' : [ 0x3c, ['unsigned long']],
    'CheckSum' : [ 0x40, ['unsigned long']],
    'Subsystem' : [ 0x44, ['unsigned short']],
    'DllCharacteristics' : [ 0x46, ['unsigned short']],
    'SizeOfStackReserve' : [ 0x48, ['unsigned long']],
    'SizeOfStackCommit' : [ 0x4c, ['unsigned long']],
    'SizeOfHeapReserve' : [ 0x50, ['unsigned long']],
    'SizeOfHeapCommit' : [ 0x54, ['unsigned long']],
    'LoaderFlags' : [ 0x58, ['unsigned long']],
    'NumberOfRvaAndSizes' : [ 0x5c, ['unsigned long']],
    'DataDirectory' : [ 0x60, ['array', 16, ['_IMAGE_DATA_DIRECTORY']]],
} ],
  '_NDIS_OPEN_BLOCK' : [ 0xf4, {
    'MacHandle' : [ 0x0, ['pointer', ['void']]],
    'BindingHandle' : [ 0x4, ['pointer', ['void']]],
    'MiniportHandle' : [ 0x8, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'ProtocolHandle' : [ 0xc, ['pointer', ['_NDIS_PROTOCOL_BLOCK']]],
    'ProtocolBindingContext' : [ 0x10, ['pointer', ['void']]],
    'MiniportNextOpen' : [ 0x14, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'ProtocolNextOpen' : [ 0x18, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'MiniportAdapterContext' : [ 0x1c, ['pointer', ['void']]],
    'Reserved1' : [ 0x20, ['unsigned char']],
    'Reserved2' : [ 0x21, ['unsigned char']],
    'Reserved3' : [ 0x22, ['unsigned char']],
    'Reserved4' : [ 0x23, ['unsigned char']],
    'BindDeviceName' : [ 0x24, ['pointer', ['_UNICODE_STRING']]],
    'Reserved5' : [ 0x28, ['unsigned long']],
    'RootDeviceName' : [ 0x2c, ['pointer', ['_UNICODE_STRING']]],
    'SendHandler' : [ 0x30, ['pointer', ['void']]],
    'WanSendHandler' : [ 0x30, ['pointer', ['void']]],
    'TransferDataHandler' : [ 0x34, ['pointer', ['void']]],
    'SendCompleteHandler' : [ 0x38, ['pointer', ['void']]],
    'TransferDataCompleteHandler' : [ 0x3c, ['pointer', ['void']]],
    'ReceiveHandler' : [ 0x40, ['pointer', ['void']]],
    'ReceiveCompleteHandler' : [ 0x44, ['pointer', ['void']]],
    'WanReceiveHandler' : [ 0x48, ['pointer', ['void']]],
    'RequestCompleteHandler' : [ 0x4c, ['pointer', ['void']]],
    'ReceivePacketHandler' : [ 0x50, ['pointer', ['void']]],
    'SendPacketsHandler' : [ 0x54, ['pointer', ['void']]],
    'ResetHandler' : [ 0x58, ['pointer', ['void']]],
    'RequestHandler' : [ 0x5c, ['pointer', ['void']]],
    'ResetCompleteHandler' : [ 0x60, ['pointer', ['void']]],
    'StatusHandler' : [ 0x64, ['pointer', ['void']]],
    'StatusCompleteHandler' : [ 0x68, ['pointer', ['void']]],
    'Flags' : [ 0x6c, ['unsigned long']],
    'References' : [ 0x70, ['long']],
    'SpinLock' : [ 0x74, ['unsigned long']],
    'FilterHandle' : [ 0x78, ['pointer', ['void']]],
    'ProtocolOptions' : [ 0x7c, ['unsigned long']],
    'CurrentLookahead' : [ 0x80, ['unsigned short']],
    'ConnectDampTicks' : [ 0x82, ['unsigned short']],
    'DisconnectDampTicks' : [ 0x84, ['unsigned short']],
    'WSendHandler' : [ 0x88, ['pointer', ['void']]],
    'WTransferDataHandler' : [ 0x8c, ['pointer', ['void']]],
    'WSendPacketsHandler' : [ 0x90, ['pointer', ['void']]],
    'CancelSendPacketsHandler' : [ 0x94, ['pointer', ['void']]],
    'WakeUpEnable' : [ 0x98, ['unsigned long']],
    'CloseCompleteEvent' : [ 0x9c, ['pointer', ['_KEVENT']]],
    'QC' : [ 0xa0, ['_QUEUED_CLOSE']],
    'AfReferences' : [ 0xb4, ['long']],
    'NextGlobalOpen' : [ 0xb8, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'NextAf' : [ 0xbc, ['pointer', ['_NDIS_CO_AF_BLOCK']]],
    'MiniportCoCreateVcHandler' : [ 0xc0, ['pointer', ['void']]],
    'MiniportCoRequestHandler' : [ 0xc4, ['pointer', ['void']]],
    'CoCreateVcHandler' : [ 0xc8, ['pointer', ['void']]],
    'CoDeleteVcHandler' : [ 0xcc, ['pointer', ['void']]],
    'CmActivateVcCompleteHandler' : [ 0xd0, ['pointer', ['void']]],
    'CmDeactivateVcCompleteHandler' : [ 0xd4, ['pointer', ['void']]],
    'CoRequestCompleteHandler' : [ 0xd8, ['pointer', ['void']]],
    'ActiveVcHead' : [ 0xdc, ['_LIST_ENTRY']],
    'InactiveVcHead' : [ 0xe4, ['_LIST_ENTRY']],
    'PendingAfNotifications' : [ 0xec, ['long']],
    'AfNotifyCompleteEvent' : [ 0xf0, ['pointer', ['_KEVENT']]],
} ],
  '_CM_FULL_RESOURCE_DESCRIPTOR' : [ 0x20, {
#    'InterfaceType' : [ 0x0, [UNIMPLEMENTED LF_ENUM]],
    'BusNumber' : [ 0x4, ['unsigned long']],
    'PartialResourceList' : [ 0x8, ['_CM_PARTIAL_RESOURCE_LIST']],
} ],
  '_KSPIN_DESCRIPTOR_EX' : [ 0x50, {
    'Dispatch' : [ 0x0, ['pointer', ['_KSPIN_DISPATCH']]],
    'AutomationTable' : [ 0x4, ['pointer', ['KSAUTOMATION_TABLE_']]],
    'PinDescriptor' : [ 0x8, ['KSPIN_DESCRIPTOR']],
    'Flags' : [ 0x38, ['unsigned long']],
    'InstancesPossible' : [ 0x3c, ['unsigned long']],
    'InstancesNecessary' : [ 0x40, ['unsigned long']],
    'AllocatorFraming' : [ 0x44, ['pointer', ['KSALLOCATOR_FRAMING_EX']]],
    'IntersectHandler' : [ 0x48, ['pointer', ['void']]],
} ],
  '_WAIT_CONTEXT_BLOCK' : [ 0x28, {
    'WaitQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DeviceRoutine' : [ 0x10, ['pointer', ['void']]],
    'DeviceContext' : [ 0x14, ['pointer', ['void']]],
    'NumberOfMapRegisters' : [ 0x18, ['unsigned long']],
    'DeviceObject' : [ 0x1c, ['pointer', ['void']]],
    'CurrentIrp' : [ 0x20, ['pointer', ['void']]],
    'BufferChainingDpc' : [ 0x24, ['pointer', ['_KDPC']]],
} ],
  '_KDPC' : [ 0x20, {
    'Type' : [ 0x0, ['short']],
    'Number' : [ 0x2, ['unsigned char']],
    'Importance' : [ 0x3, ['unsigned char']],
    'DpcListEntry' : [ 0x4, ['_LIST_ENTRY']],
    'DeferredRoutine' : [ 0xc, ['pointer', ['void']]],
    'DeferredContext' : [ 0x10, ['pointer', ['void']]],
    'SystemArgument1' : [ 0x14, ['pointer', ['void']]],
    'SystemArgument2' : [ 0x18, ['pointer', ['void']]],
    'Lock' : [ 0x1c, ['pointer', ['unsigned long']]],
} ],
  '_NDIS_REQUEST' : [ 0x5c, {
    'MacReserved' : [ 0x0, ['array', 16, ['unsigned char']]],
#    'RequestType' : [ 0x10, [UNIMPLEMENTED LF_ENUM]],
    'DATA' : [ 0x14, ['_DATA']],
    'NdisReserved' : [ 0x28, ['array', 36, ['unsigned char']]],
    'CallMgrReserved' : [ 0x4c, ['array', 8, ['unsigned char']]],
    'ProtocolReserved' : [ 0x4c, ['array', 8, ['unsigned char']]],
    'MiniportReserved' : [ 0x54, ['array', 8, ['unsigned char']]],
} ],
  '__unnamed_128b' : [ 0x4, {
    'MasterIrp' : [ 0x0, ['pointer', ['_IRP']]],
    'IrpCount' : [ 0x0, ['long']],
    'SystemBuffer' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_1290' : [ 0x8, {
    'UserApcRoutine' : [ 0x0, ['pointer', ['void']]],
    'UserApcContext' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_1292' : [ 0x8, {
    'AsynchronousParameters' : [ 0x0, ['__unnamed_1290']],
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
} ],
  '__unnamed_129a' : [ 0x28, {
    'DeviceQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DriverContext' : [ 0x0, ['array', 4, ['pointer', ['void']]]],
    'Thread' : [ 0x10, ['pointer', ['_ETHREAD']]],
    'AuxiliaryBuffer' : [ 0x14, ['pointer', ['unsigned char']]],
    'ListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'CurrentStackLocation' : [ 0x20, ['pointer', ['_IO_STACK_LOCATION']]],
    'PacketType' : [ 0x20, ['unsigned long']],
    'OriginalFileObject' : [ 0x24, ['pointer', ['_FILE_OBJECT']]],
} ],
  '__unnamed_129d' : [ 0x30, {
    'Overlay' : [ 0x0, ['__unnamed_129a']],
    'Apc' : [ 0x0, ['_KAPC']],
    'CompletionKey' : [ 0x0, ['pointer', ['void']]],
} ],
  '_IRP' : [ 0x70, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'MdlAddress' : [ 0x4, ['pointer', ['_MDL']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'AssociatedIrp' : [ 0xc, ['__unnamed_128b']],
    'ThreadListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'IoStatus' : [ 0x18, ['_IO_STATUS_BLOCK']],
    'RequestorMode' : [ 0x20, ['unsigned char']],
    'PendingReturned' : [ 0x21, ['unsigned char']],
    'StackCount' : [ 0x22, ['unsigned char']],
    'CurrentLocation' : [ 0x23, ['unsigned char']],
    'Cancel' : [ 0x24, ['unsigned char']],
    'CancelIrql' : [ 0x25, ['unsigned char']],
    'ApcEnvironment' : [ 0x26, ['unsigned char']],
    'AllocationFlags' : [ 0x27, ['unsigned char']],
    'UserIosb' : [ 0x28, ['pointer', ['_IO_STATUS_BLOCK']]],
    'UserEvent' : [ 0x2c, ['pointer', ['_KEVENT']]],
    'Overlay' : [ 0x30, ['__unnamed_1292']],
    'CancelRoutine' : [ 0x38, ['pointer', ['void']]],
    'UserBuffer' : [ 0x3c, ['pointer', ['void']]],
    'Tail' : [ 0x40, ['__unnamed_129d']],
} ],
  '_NDIS_WRAPPER_HANDLE' : [ 0xc, {
    'DriverObject' : [ 0x0, ['pointer', ['_DRIVER_OBJECT']]],
    'ServiceRegPath' : [ 0x4, ['_UNICODE_STRING']],
} ],
  '_OWNER_ENTRY' : [ 0x8, {
    'OwnerThread' : [ 0x0, ['unsigned long']],
    'OwnerCount' : [ 0x4, ['long']],
    'TableSize' : [ 0x4, ['unsigned long']],
} ],
  '_KMUTANT' : [ 0x20, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'MutantListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'OwnerThread' : [ 0x18, ['pointer', ['_KTHREAD']]],
    'Abandoned' : [ 0x1c, ['unsigned char']],
    'ApcDisable' : [ 0x1d, ['unsigned char']],
} ],
  '_NDIS_PKT_POOL_HDR' : [ 0x20, {
    'List' : [ 0x0, ['_LIST_ENTRY']],
    'TimeStamp' : [ 0x8, ['_LARGE_INTEGER']],
    'FreeList' : [ 0x10, ['_SLIST_HEADER']],
#    'State' : [ 0x18, [UNIMPLEMENTED LF_ENUM]],
} ],
  '_CM_RESOURCE_LIST' : [ 0x24, {
    'Count' : [ 0x0, ['unsigned long']],
    'List' : [ 0x4, ['array', 1, ['_CM_FULL_RESOURCE_DESCRIPTOR']]],
} ],
  '_NDIS_CO_AF_BLOCK' : [ 0x78, {
    'NextAf' : [ 0x0, ['pointer', ['_NDIS_CO_AF_BLOCK']]],
    'Flags' : [ 0x4, ['unsigned long']],
    'References' : [ 0x8, ['long']],
    'Miniport' : [ 0xc, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'CallMgrEntries' : [ 0x10, ['pointer', ['_NDIS_CALL_MANAGER_CHARACTERISTICS']]],
    'CallMgrOpen' : [ 0x14, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'CallMgrContext' : [ 0x18, ['pointer', ['void']]],
    'ClientEntries' : [ 0x1c, ['_NDIS_CLIENT_CHARACTERISTICS']],
    'ClientOpen' : [ 0x6c, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'ClientContext' : [ 0x70, ['pointer', ['void']]],
    'Lock' : [ 0x74, ['unsigned long']],
} ],
  '_KSNODE_DESCRIPTOR' : [ 0x10, {
    'AutomationTable' : [ 0x0, ['pointer', ['KSAUTOMATION_TABLE_']]],
    'Type' : [ 0x4, ['pointer', ['_GUID']]],
    'Name' : [ 0x8, ['pointer', ['_GUID']]],
    'Alignment' : [ 0xc, ['pointer', ['void']]],
} ],
  '_CO_CALL_PARAMETERS' : [ 0xc, {
    'Flags' : [ 0x0, ['unsigned long']],
    'CallMgrParameters' : [ 0x4, ['pointer', ['_CO_CALL_MANAGER_PARAMETERS']]],
    'MediaParameters' : [ 0x8, ['pointer', ['_CO_MEDIA_PARAMETERS']]],
} ],
  '_NDIS_CO_VC_BLOCK' : [ 0x48, {
    'References' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'Lock' : [ 0x8, ['unsigned long']],
    'ClientOpen' : [ 0xc, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'ClientContext' : [ 0x10, ['pointer', ['void']]],
    'pProxyVcPtr' : [ 0x14, ['pointer', ['_NDIS_CO_VC_PTR_BLOCK']]],
    'pClientVcPtr' : [ 0x18, ['pointer', ['_NDIS_CO_VC_PTR_BLOCK']]],
    'CoSendCompleteHandler' : [ 0x1c, ['pointer', ['void']]],
    'CoReceivePacketHandler' : [ 0x20, ['pointer', ['void']]],
    'CallMgrOpen' : [ 0x24, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'CallMgrContext' : [ 0x28, ['pointer', ['void']]],
    'CmActivateVcCompleteHandler' : [ 0x2c, ['pointer', ['void']]],
    'CmDeactivateVcCompleteHandler' : [ 0x30, ['pointer', ['void']]],
    'CmModifyCallQoSHandler' : [ 0x34, ['pointer', ['void']]],
    'Miniport' : [ 0x38, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'MiniportContext' : [ 0x3c, ['pointer', ['void']]],
    'VcId' : [ 0x40, ['unsigned long long']],
} ],
  '_NDIS50_PROTOCOL_CHARACTERISTICS' : [ 0x6c, {
    'MajorNdisVersion' : [ 0x0, ['unsigned char']],
    'MinorNdisVersion' : [ 0x1, ['unsigned char']],
    'Filler' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'OpenAdapterCompleteHandler' : [ 0x8, ['pointer', ['void']]],
    'CloseAdapterCompleteHandler' : [ 0xc, ['pointer', ['void']]],
    'SendCompleteHandler' : [ 0x10, ['pointer', ['void']]],
    'WanSendCompleteHandler' : [ 0x10, ['pointer', ['void']]],
    'TransferDataCompleteHandler' : [ 0x14, ['pointer', ['void']]],
    'WanTransferDataCompleteHandler' : [ 0x14, ['pointer', ['void']]],
    'ResetCompleteHandler' : [ 0x18, ['pointer', ['void']]],
    'RequestCompleteHandler' : [ 0x1c, ['pointer', ['void']]],
    'ReceiveHandler' : [ 0x20, ['pointer', ['void']]],
    'WanReceiveHandler' : [ 0x20, ['pointer', ['void']]],
    'ReceiveCompleteHandler' : [ 0x24, ['pointer', ['void']]],
    'StatusHandler' : [ 0x28, ['pointer', ['void']]],
    'StatusCompleteHandler' : [ 0x2c, ['pointer', ['void']]],
    'Name' : [ 0x30, ['_UNICODE_STRING']],
    'ReceivePacketHandler' : [ 0x38, ['pointer', ['void']]],
    'BindAdapterHandler' : [ 0x3c, ['pointer', ['void']]],
    'UnbindAdapterHandler' : [ 0x40, ['pointer', ['void']]],
    'PnPEventHandler' : [ 0x44, ['pointer', ['void']]],
    'UnloadHandler' : [ 0x48, ['pointer', ['void']]],
    'ReservedHandlers' : [ 0x4c, ['array', 4, ['pointer', ['void']]]],
    'CoSendCompleteHandler' : [ 0x5c, ['pointer', ['void']]],
    'CoStatusHandler' : [ 0x60, ['pointer', ['void']]],
    'CoReceivePacketHandler' : [ 0x64, ['pointer', ['void']]],
    'CoAfRegisterNotifyHandler' : [ 0x68, ['pointer', ['void']]],
} ],
  '_KSPIN_DISPATCH' : [ 0x28, {
    'Create' : [ 0x0, ['pointer', ['void']]],
    'Close' : [ 0x4, ['pointer', ['void']]],
    'Process' : [ 0x8, ['pointer', ['void']]],
    'Reset' : [ 0xc, ['pointer', ['void']]],
    'SetDataFormat' : [ 0x10, ['pointer', ['void']]],
    'SetDeviceState' : [ 0x14, ['pointer', ['void']]],
    'Connect' : [ 0x18, ['pointer', ['void']]],
    'Disconnect' : [ 0x1c, ['pointer', ['void']]],
    'Clock' : [ 0x20, ['pointer', ['_KSCLOCK_DISPATCH']]],
    'Allocator' : [ 0x24, ['pointer', ['_KSALLOCATOR_DISPATCH']]],
} ],
  '_DEVOBJ_EXTENSION' : [ 0x8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
} ],
  '_NET_PNP_EVENT' : [ 0x4c, {
#    'NetEvent' : [ 0x0, [UNIMPLEMENTED LF_ENUM]],
    'Buffer' : [ 0x4, ['pointer', ['void']]],
    'BufferLength' : [ 0x8, ['unsigned long']],
    'NdisReserved' : [ 0xc, ['array', 4, ['unsigned long']]],
    'TransportReserved' : [ 0x1c, ['array', 4, ['unsigned long']]],
    'TdiReserved' : [ 0x2c, ['array', 4, ['unsigned long']]],
    'TdiClientReserved' : [ 0x3c, ['array', 4, ['unsigned long']]],
} ],
  '_NDIS_CLIENT_CHARACTERISTICS' : [ 0x50, {
    'MajorVersion' : [ 0x0, ['unsigned char']],
    'MinorVersion' : [ 0x1, ['unsigned char']],
    'Filler' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'ClCreateVcHandler' : [ 0x8, ['pointer', ['void']]],
    'ClDeleteVcHandler' : [ 0xc, ['pointer', ['void']]],
    'ClRequestHandler' : [ 0x10, ['pointer', ['void']]],
    'ClRequestCompleteHandler' : [ 0x14, ['pointer', ['void']]],
    'ClOpenAfCompleteHandler' : [ 0x18, ['pointer', ['void']]],
    'ClCloseAfCompleteHandler' : [ 0x1c, ['pointer', ['void']]],
    'ClRegisterSapCompleteHandler' : [ 0x20, ['pointer', ['void']]],
    'ClDeregisterSapCompleteHandler' : [ 0x24, ['pointer', ['void']]],
    'ClMakeCallCompleteHandler' : [ 0x28, ['pointer', ['void']]],
    'ClModifyCallQoSCompleteHandler' : [ 0x2c, ['pointer', ['void']]],
    'ClCloseCallCompleteHandler' : [ 0x30, ['pointer', ['void']]],
    'ClAddPartyCompleteHandler' : [ 0x34, ['pointer', ['void']]],
    'ClDropPartyCompleteHandler' : [ 0x38, ['pointer', ['void']]],
    'ClIncomingCallHandler' : [ 0x3c, ['pointer', ['void']]],
    'ClIncomingCallQoSChangeHandler' : [ 0x40, ['pointer', ['void']]],
    'ClIncomingCloseCallHandler' : [ 0x44, ['pointer', ['void']]],
    'ClIncomingDropPartyHandler' : [ 0x48, ['pointer', ['void']]],
    'ClCallConnectedHandler' : [ 0x4c, ['pointer', ['void']]],
} ],
  '_NDIS_WAN_PACKET' : [ 0x38, {
    'WanPacketQueue' : [ 0x0, ['_LIST_ENTRY']],
    'CurrentBuffer' : [ 0x8, ['pointer', ['unsigned char']]],
    'CurrentLength' : [ 0xc, ['unsigned long']],
    'StartBuffer' : [ 0x10, ['pointer', ['unsigned char']]],
    'EndBuffer' : [ 0x14, ['pointer', ['unsigned char']]],
    'ProtocolReserved1' : [ 0x18, ['pointer', ['void']]],
    'ProtocolReserved2' : [ 0x1c, ['pointer', ['void']]],
    'ProtocolReserved3' : [ 0x20, ['pointer', ['void']]],
    'ProtocolReserved4' : [ 0x24, ['pointer', ['void']]],
    'MacReserved1' : [ 0x28, ['pointer', ['void']]],
    'MacReserved2' : [ 0x2c, ['pointer', ['void']]],
    'MacReserved3' : [ 0x30, ['pointer', ['void']]],
    'MacReserved4' : [ 0x34, ['pointer', ['void']]],
} ],
  '_KSALLOCATOR_DISPATCH' : [ 0x10, {
    'InitializeAllocator' : [ 0x0, ['pointer', ['void']]],
    'DeleteAllocator' : [ 0x4, ['pointer', ['void']]],
    'Allocate' : [ 0x8, ['pointer', ['void']]],
    'Free' : [ 0xc, ['pointer', ['void']]],
} ],
  '_KSCLOCK_DISPATCH' : [ 0x10, {
    'SetTimer' : [ 0x0, ['pointer', ['void']]],
    'CancelTimer' : [ 0x4, ['pointer', ['void']]],
    'CorrelatedTime' : [ 0x8, ['pointer', ['void']]],
    'Resolution' : [ 0xc, ['pointer', ['void']]],
} ],
  '_NDIS_CO_VC_PTR_BLOCK' : [ 0x98, {
    'References' : [ 0x0, ['long']],
    'CallFlags' : [ 0x4, ['unsigned long']],
    'pVcFlags' : [ 0x8, ['pointer', ['unsigned long']]],
    'Lock' : [ 0xc, ['unsigned long']],
    'ClientContext' : [ 0x10, ['pointer', ['void']]],
    'ClientLink' : [ 0x14, ['_LIST_ENTRY']],
    'VcLink' : [ 0x1c, ['_LIST_ENTRY']],
    'AfBlock' : [ 0x24, ['pointer', ['_NDIS_CO_AF_BLOCK']]],
    'VcBlock' : [ 0x28, ['pointer', ['_NDIS_CO_VC_BLOCK']]],
    'ClientOpen' : [ 0x2c, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'OwnsVcBlock' : [ 0x30, ['long']],
    'CoDeleteVcHandler' : [ 0x34, ['pointer', ['void']]],
    'DeleteVcContext' : [ 0x38, ['pointer', ['void']]],
    'ClModifyCallQoSCompleteHandler' : [ 0x3c, ['pointer', ['void']]],
    'ClIncomingCallQoSChangeHandler' : [ 0x40, ['pointer', ['void']]],
    'ClCallConnectedHandler' : [ 0x44, ['pointer', ['void']]],
    'CallMgrOpen' : [ 0x48, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'CallMgrContext' : [ 0x4c, ['pointer', ['void']]],
    'CallMgrLink' : [ 0x50, ['_LIST_ENTRY']],
    'CmActivateVcCompleteHandler' : [ 0x58, ['pointer', ['void']]],
    'CmDeactivateVcCompleteHandler' : [ 0x5c, ['pointer', ['void']]],
    'CmModifyCallQoSHandler' : [ 0x60, ['pointer', ['void']]],
    'Miniport' : [ 0x64, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'MiniportContext' : [ 0x68, ['pointer', ['void']]],
    'WCoSendPacketsHandler' : [ 0x6c, ['pointer', ['void']]],
    'WCoDeleteVcHandler' : [ 0x70, ['pointer', ['void']]],
    'WCoActivateVcHandler' : [ 0x74, ['pointer', ['void']]],
    'WCoDeactivateVcHandler' : [ 0x78, ['pointer', ['void']]],
    'VcInstanceName' : [ 0x7c, ['_UNICODE_STRING']],
    'VcIndex' : [ 0x88, ['_LARGE_INTEGER']],
    'WmiLink' : [ 0x90, ['_LIST_ENTRY']],
} ],
  '_KEVENT' : [ 0x10, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
} ],
  '_CO_MEDIA_PARAMETERS' : [ 0x18, {
    'Flags' : [ 0x0, ['unsigned long']],
    'ReceivePriority' : [ 0x4, ['unsigned long']],
    'ReceiveSizeHint' : [ 0x8, ['unsigned long']],
    'MediaSpecific' : [ 0xc, ['_CO_SPECIFIC_PARAMETERS']],
} ],
  '_NDIS_MINIPORT_BLOCK' : [ 0x4a0, {
    'Signature' : [ 0x0, ['pointer', ['void']]],
    'NextMiniport' : [ 0x4, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'DriverHandle' : [ 0x8, ['pointer', ['_NDIS_M_DRIVER_BLOCK']]],
    'MiniportAdapterContext' : [ 0xc, ['pointer', ['void']]],
    'MiniportName' : [ 0x10, ['_UNICODE_STRING']],
    'BindPaths' : [ 0x18, ['pointer', ['_NDIS_BIND_PATHS']]],
    'OpenQueue' : [ 0x1c, ['pointer', ['void']]],
    'ShortRef' : [ 0x20, ['_REFERENCE']],
    'DeviceContext' : [ 0x28, ['pointer', ['void']]],
    'Padding1' : [ 0x2c, ['unsigned char']],
    'LockAcquired' : [ 0x2d, ['unsigned char']],
    'PmodeOpens' : [ 0x2e, ['unsigned char']],
    'AssignedProcessor' : [ 0x2f, ['unsigned char']],
    'Lock' : [ 0x30, ['unsigned long']],
    'MediaRequest' : [ 0x34, ['pointer', ['_NDIS_REQUEST']]],
    'Interrupt' : [ 0x38, ['pointer', ['_NDIS_MINIPORT_INTERRUPT']]],
    'Flags' : [ 0x3c, ['unsigned long']],
    'PnPFlags' : [ 0x40, ['unsigned long']],
    'PacketList' : [ 0x44, ['_LIST_ENTRY']],
    'FirstPendingPacket' : [ 0x4c, ['pointer', ['_NDIS_PACKET']]],
    'ReturnPacketsQueue' : [ 0x50, ['pointer', ['_NDIS_PACKET']]],
    'RequestBuffer' : [ 0x54, ['unsigned long']],
    'SetMCastBuffer' : [ 0x58, ['pointer', ['void']]],
    'PrimaryMiniport' : [ 0x5c, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'WrapperContext' : [ 0x60, ['pointer', ['void']]],
    'BusDataContext' : [ 0x64, ['pointer', ['void']]],
    'PnPCapabilities' : [ 0x68, ['unsigned long']],
    'Resources' : [ 0x6c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'WakeUpDpcTimer' : [ 0x70, ['_NDIS_TIMER']],
    'BaseName' : [ 0xb8, ['_UNICODE_STRING']],
    'SymbolicLinkName' : [ 0xc0, ['_UNICODE_STRING']],
    'CheckForHangSeconds' : [ 0xc8, ['unsigned long']],
    'CFHangTicks' : [ 0xcc, ['unsigned short']],
    'CFHangCurrentTick' : [ 0xce, ['unsigned short']],
    'ResetStatus' : [ 0xd0, ['long']],
    'ResetOpen' : [ 0xd4, ['pointer', ['void']]],
    'EthDB' : [ 0xd8, ['pointer', ['_X_FILTER']]],
    'NullDB' : [ 0xd8, ['pointer', ['_X_FILTER']]],
    'TrDB' : [ 0xdc, ['pointer', ['_X_FILTER']]],
    'FddiDB' : [ 0xe0, ['pointer', ['_X_FILTER']]],
    'ArcDB' : [ 0xe4, ['pointer', ['_ARC_FILTER']]],
    'PacketIndicateHandler' : [ 0xe8, ['pointer', ['void']]],
    'SendCompleteHandler' : [ 0xec, ['pointer', ['void']]],
    'SendResourcesHandler' : [ 0xf0, ['pointer', ['void']]],
    'ResetCompleteHandler' : [ 0xf4, ['pointer', ['void']]],
#    'MediaType' : [ 0xf8, [UNIMPLEMENTED LF_ENUM]],
    'BusNumber' : [ 0xfc, ['unsigned long']],
#    'BusType' : [ 0x100, [UNIMPLEMENTED LF_ENUM]],
#    'AdapterType' : [ 0x104, [UNIMPLEMENTED LF_ENUM]],
    'DeviceObject' : [ 0x108, ['pointer', ['_DEVICE_OBJECT']]],
    'PhysicalDeviceObject' : [ 0x10c, ['pointer', ['_DEVICE_OBJECT']]],
    'NextDeviceObject' : [ 0x110, ['pointer', ['_DEVICE_OBJECT']]],
    'MapRegisters' : [ 0x114, ['pointer', ['_MAP_REGISTER_ENTRY']]],
    'CallMgrAfList' : [ 0x118, ['pointer', ['_NDIS_AF_LIST']]],
    'MiniportThread' : [ 0x11c, ['pointer', ['void']]],
    'SetInfoBuf' : [ 0x120, ['pointer', ['void']]],
    'SetInfoBufLen' : [ 0x124, ['unsigned short']],
    'MaxSendPackets' : [ 0x126, ['unsigned short']],
    'FakeStatus' : [ 0x128, ['long']],
    'LockHandler' : [ 0x12c, ['pointer', ['void']]],
    'pAdapterInstanceName' : [ 0x130, ['pointer', ['_UNICODE_STRING']]],
    'TimerQueue' : [ 0x134, ['pointer', ['_NDIS_MINIPORT_TIMER']]],
    'MacOptions' : [ 0x138, ['unsigned long']],
    'PendingRequest' : [ 0x13c, ['pointer', ['_NDIS_REQUEST']]],
    'MaximumLongAddresses' : [ 0x140, ['unsigned long']],
    'MaximumShortAddresses' : [ 0x144, ['unsigned long']],
    'CurrentLookahead' : [ 0x148, ['unsigned long']],
    'MaximumLookahead' : [ 0x14c, ['unsigned long']],
    'HandleInterruptHandler' : [ 0x150, ['pointer', ['void']]],
    'DisableInterruptHandler' : [ 0x154, ['pointer', ['void']]],
    'EnableInterruptHandler' : [ 0x158, ['pointer', ['void']]],
    'SendPacketsHandler' : [ 0x15c, ['pointer', ['void']]],
    'DeferredSendHandler' : [ 0x160, ['pointer', ['void']]],
    'EthRxIndicateHandler' : [ 0x164, ['pointer', ['void']]],
    'TrRxIndicateHandler' : [ 0x168, ['pointer', ['void']]],
    'FddiRxIndicateHandler' : [ 0x16c, ['pointer', ['void']]],
    'EthRxCompleteHandler' : [ 0x170, ['pointer', ['void']]],
    'TrRxCompleteHandler' : [ 0x174, ['pointer', ['void']]],
    'FddiRxCompleteHandler' : [ 0x178, ['pointer', ['void']]],
    'StatusHandler' : [ 0x17c, ['pointer', ['void']]],
    'StatusCompleteHandler' : [ 0x180, ['pointer', ['void']]],
    'TDCompleteHandler' : [ 0x184, ['pointer', ['void']]],
    'QueryCompleteHandler' : [ 0x188, ['pointer', ['void']]],
    'SetCompleteHandler' : [ 0x18c, ['pointer', ['void']]],
    'WanSendCompleteHandler' : [ 0x190, ['pointer', ['void']]],
    'WanRcvHandler' : [ 0x194, ['pointer', ['void']]],
    'WanRcvCompleteHandler' : [ 0x198, ['pointer', ['void']]],
    'NextGlobalMiniport' : [ 0x19c, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'WorkQueue' : [ 0x1a0, ['array', 7, ['_SINGLE_LIST_ENTRY']]],
    'SingleWorkItems' : [ 0x1bc, ['array', 6, ['_SINGLE_LIST_ENTRY']]],
    'SendFlags' : [ 0x1d4, ['unsigned char']],
    'TrResetRing' : [ 0x1d5, ['unsigned char']],
    'ArcnetAddress' : [ 0x1d6, ['unsigned char']],
    'XState' : [ 0x1d7, ['unsigned char']],
    'ArcBuf' : [ 0x1d8, ['pointer', ['_NDIS_ARC_BUF']]],
    'BusInterface' : [ 0x1d8, ['pointer', ['void']]],
    'Log' : [ 0x1dc, ['pointer', ['_NDIS_LOG']]],
    'SlotNumber' : [ 0x1e0, ['unsigned long']],
    'AllocatedResources' : [ 0x1e4, ['pointer', ['_CM_RESOURCE_LIST']]],
    'AllocatedResourcesTranslated' : [ 0x1e8, ['pointer', ['_CM_RESOURCE_LIST']]],
    'PatternList' : [ 0x1ec, ['_SINGLE_LIST_ENTRY']],
    'PMCapabilities' : [ 0x1f0, ['_NDIS_PNP_CAPABILITIES']],
    'DeviceCaps' : [ 0x200, ['_DEVICE_CAPABILITIES']],
    'WakeUpEnable' : [ 0x240, ['unsigned long']],
#    'CurrentDevicePowerState' : [ 0x244, [UNIMPLEMENTED LF_ENUM]],
    'pIrpWaitWake' : [ 0x248, ['pointer', ['_IRP']]],
#    'WaitWakeSystemState' : [ 0x24c, [UNIMPLEMENTED LF_ENUM]],
    'VcIndex' : [ 0x250, ['_LARGE_INTEGER']],
    'VcCountLock' : [ 0x258, ['unsigned long']],
    'WmiEnabledVcs' : [ 0x25c, ['_LIST_ENTRY']],
    'pNdisGuidMap' : [ 0x264, ['pointer', ['_NDIS_GUID']]],
    'pCustomGuidMap' : [ 0x268, ['pointer', ['_NDIS_GUID']]],
    'VcCount' : [ 0x26c, ['unsigned short']],
    'cNdisGuidMap' : [ 0x26e, ['unsigned short']],
    'cCustomGuidMap' : [ 0x270, ['unsigned short']],
    'CurrentMapRegister' : [ 0x272, ['unsigned short']],
    'AllocationEvent' : [ 0x274, ['pointer', ['_KEVENT']]],
    'BaseMapRegistersNeeded' : [ 0x278, ['unsigned short']],
    'SGMapRegistersNeeded' : [ 0x27a, ['unsigned short']],
    'MaximumPhysicalMapping' : [ 0x27c, ['unsigned long']],
    'MediaDisconnectTimer' : [ 0x280, ['_NDIS_TIMER']],
    'MediaDisconnectTimeOut' : [ 0x2c8, ['unsigned short']],
    'InstanceNumber' : [ 0x2ca, ['unsigned short']],
    'OpenReadyEvent' : [ 0x2cc, ['_NDIS_EVENT']],
#    'PnPDeviceState' : [ 0x2dc, [UNIMPLEMENTED LF_ENUM]],
#    'OldPnPDeviceState' : [ 0x2e0, [UNIMPLEMENTED LF_ENUM]],
    'SetBusData' : [ 0x2e4, ['pointer', ['void']]],
    'GetBusData' : [ 0x2e8, ['pointer', ['void']]],
    'DeferredDpc' : [ 0x2ec, ['_KDPC']],
    'NdisStats' : [ 0x310, ['_NDIS_STATS']],
    'IndicatedPacket' : [ 0x328, ['array', 32, ['pointer', ['_NDIS_PACKET']]]],
    'RemoveReadyEvent' : [ 0x3a8, ['pointer', ['_KEVENT']]],
    'AllOpensClosedEvent' : [ 0x3ac, ['pointer', ['_KEVENT']]],
    'AllRequestsCompletedEvent' : [ 0x3b0, ['pointer', ['_KEVENT']]],
    'InitTimeMs' : [ 0x3b4, ['unsigned long']],
    'WorkItemBuffer' : [ 0x3b8, ['array', 6, ['_NDIS_MINIPORT_WORK_ITEM']]],
    'SystemAdapterObject' : [ 0x400, ['pointer', ['_DMA_ADAPTER']]],
    'DriverVerifyFlags' : [ 0x404, ['unsigned long']],
    'OidList' : [ 0x408, ['pointer', ['_OID_LIST']]],
    'InternalResetCount' : [ 0x40c, ['unsigned short']],
    'MiniportResetCount' : [ 0x40e, ['unsigned short']],
    'MediaSenseConnectCount' : [ 0x410, ['unsigned short']],
    'MediaSenseDisconnectCount' : [ 0x412, ['unsigned short']],
    'xPackets' : [ 0x414, ['pointer', ['pointer', ['_NDIS_PACKET']]]],
    'UserModeOpenReferences' : [ 0x418, ['unsigned long']],
    'SavedSendHandler' : [ 0x41c, ['pointer', ['void']]],
    'SavedWanSendHandler' : [ 0x41c, ['pointer', ['void']]],
    'SavedSendPacketsHandler' : [ 0x420, ['pointer', ['void']]],
    'SavedCancelSendPacketsHandler' : [ 0x424, ['pointer', ['void']]],
    'WSendPacketsHandler' : [ 0x428, ['pointer', ['void']]],
    'MiniportAttributes' : [ 0x42c, ['unsigned long']],
    'SavedSystemAdapterObject' : [ 0x430, ['pointer', ['_DMA_ADAPTER']]],
    'NumOpens' : [ 0x434, ['unsigned short']],
    'CFHangXTicks' : [ 0x436, ['unsigned short']],
    'RequestCount' : [ 0x438, ['unsigned long']],
    'IndicatedPacketsCount' : [ 0x43c, ['unsigned long']],
    'PhysicalMediumType' : [ 0x440, ['unsigned long']],
    'LastRequest' : [ 0x444, ['pointer', ['_NDIS_REQUEST']]],
    'DmaAdapterRefCount' : [ 0x448, ['long']],
    'FakeMac' : [ 0x44c, ['pointer', ['void']]],
    'LockDbg' : [ 0x450, ['unsigned long']],
    'LockDbgX' : [ 0x454, ['unsigned long']],
    'LockThread' : [ 0x458, ['pointer', ['void']]],
    'InfoFlags' : [ 0x45c, ['unsigned long']],
    'TimerQueueLock' : [ 0x460, ['unsigned long']],
    'ResetCompletedEvent' : [ 0x464, ['pointer', ['_KEVENT']]],
    'QueuedBindingCompletedEvent' : [ 0x468, ['pointer', ['_KEVENT']]],
    'DmaResourcesReleasedEvent' : [ 0x46c, ['pointer', ['_KEVENT']]],
    'SavedPacketIndicateHandler' : [ 0x470, ['pointer', ['void']]],
    'RegisteredInterrupts' : [ 0x474, ['unsigned long']],
    'SGListLookasideList' : [ 0x478, ['pointer', ['_NPAGED_LOOKASIDE_LIST']]],
    'ScatterGatherListSize' : [ 0x47c, ['unsigned long']],
    'WakeUpTimerEvent' : [ 0x480, ['pointer', ['_KEVENT']]],
    'SecurityDescriptor' : [ 0x484, ['pointer', ['void']]],
    'NumUserOpens' : [ 0x488, ['unsigned long']],
    'NumAdminOpens' : [ 0x48c, ['unsigned long']],
    'Ref' : [ 0x490, ['_ULONG_REFERENCE']],
} ],
  '__unnamed_1396' : [ 0x2c, {
    'InitialPrivilegeSet' : [ 0x0, ['_INITIAL_PRIVILEGE_SET']],
    'PrivilegeSet' : [ 0x0, ['_PRIVILEGE_SET']],
} ],
  '_ACCESS_STATE' : [ 0x74, {
    'OperationID' : [ 0x0, ['_LUID']],
    'SecurityEvaluated' : [ 0x8, ['unsigned char']],
    'GenerateAudit' : [ 0x9, ['unsigned char']],
    'GenerateOnClose' : [ 0xa, ['unsigned char']],
    'PrivilegesAllocated' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['unsigned long']],
    'RemainingDesiredAccess' : [ 0x10, ['unsigned long']],
    'PreviouslyGrantedAccess' : [ 0x14, ['unsigned long']],
    'OriginalDesiredAccess' : [ 0x18, ['unsigned long']],
    'SubjectSecurityContext' : [ 0x1c, ['_SECURITY_SUBJECT_CONTEXT']],
    'SecurityDescriptor' : [ 0x2c, ['pointer', ['void']]],
    'AuxData' : [ 0x30, ['pointer', ['void']]],
    'Privileges' : [ 0x34, ['__unnamed_1396']],
    'AuditPrivileges' : [ 0x60, ['unsigned char']],
    'ObjectName' : [ 0x64, ['_UNICODE_STRING']],
    'ObjectTypeName' : [ 0x6c, ['_UNICODE_STRING']],
} ],
  '_KSDEVICE_DISPATCH' : [ 0x38, {
    'Add' : [ 0x0, ['pointer', ['void']]],
    'Start' : [ 0x4, ['pointer', ['void']]],
    'PostStart' : [ 0x8, ['pointer', ['void']]],
    'QueryStop' : [ 0xc, ['pointer', ['void']]],
    'CancelStop' : [ 0x10, ['pointer', ['void']]],
    'Stop' : [ 0x14, ['pointer', ['void']]],
    'QueryRemove' : [ 0x18, ['pointer', ['void']]],
    'CancelRemove' : [ 0x1c, ['pointer', ['void']]],
    'Remove' : [ 0x20, ['pointer', ['void']]],
    'QueryCapabilities' : [ 0x24, ['pointer', ['void']]],
    'SurpriseRemoval' : [ 0x28, ['pointer', ['void']]],
    'QueryPower' : [ 0x2c, ['pointer', ['void']]],
    'SetPower' : [ 0x30, ['pointer', ['void']]],
    'QueryInterface' : [ 0x34, ['pointer', ['void']]],
} ],
  '_MAP_REGISTER_ENTRY' : [ 0x8, {
    'MapRegister' : [ 0x0, ['pointer', ['void']]],
    'WriteToDevice' : [ 0x4, ['unsigned char']],
} ],
  '_ULONG_REFERENCE' : [ 0xc, {
    'SpinLock' : [ 0x0, ['unsigned long']],
    'ReferenceCount' : [ 0x4, ['unsigned long']],
    'Closing' : [ 0x8, ['unsigned char']],
} ],
  '_CO_CALL_MANAGER_PARAMETERS' : [ 0x4c, {
    'Transmit' : [ 0x0, ['_flowspec']],
    'Receive' : [ 0x20, ['_flowspec']],
    'CallMgrSpecific' : [ 0x40, ['_CO_SPECIFIC_PARAMETERS']],
} ],
  '_KSEMAPHORE' : [ 0x14, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'Limit' : [ 0x10, ['long']],
} ],
  '_KAPC' : [ 0x30, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'Spare0' : [ 0x4, ['unsigned long']],
    'Thread' : [ 0x8, ['pointer', ['_KTHREAD']]],
    'ApcListEntry' : [ 0xc, ['_LIST_ENTRY']],
    'KernelRoutine' : [ 0x14, ['pointer', ['void']]],
    'RundownRoutine' : [ 0x18, ['pointer', ['void']]],
    'NormalRoutine' : [ 0x1c, ['pointer', ['void']]],
    'NormalContext' : [ 0x20, ['pointer', ['void']]],
    'SystemArgument1' : [ 0x24, ['pointer', ['void']]],
    'SystemArgument2' : [ 0x28, ['pointer', ['void']]],
    'ApcStateIndex' : [ 0x2c, ['unsigned char']],
    'ApcMode' : [ 0x2d, ['unsigned char']],
    'Inserted' : [ 0x2e, ['unsigned char']],
} ],
  '_NDIS_STATS' : [ 0x18, {
    'StartTicks' : [ 0x0, ['_LARGE_INTEGER']],
    'DirectedPacketsOut' : [ 0x8, ['unsigned long long']],
    'DirectedPacketsIn' : [ 0x10, ['unsigned long long']],
} ],
  'CO_SAP' : [ 0xc, {
    'SapType' : [ 0x0, ['unsigned long']],
    'SapLength' : [ 0x4, ['unsigned long']],
    'Sap' : [ 0x8, ['array', 1, ['unsigned char']]],
} ],
  '_OBJECT_DUMP_CONTROL' : [ 0x8, {
    'Stream' : [ 0x0, ['pointer', ['void']]],
    'Detail' : [ 0x4, ['unsigned long']],
} ],
  '_NDIS_MINIPORT_WORK_ITEM' : [ 0xc, {
    'Link' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
#    'WorkItemType' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
    'WorkItemContext' : [ 0x8, ['pointer', ['void']]],
} ],
  'KSALLOCATOR_FRAMING' : [ 0x18, {
    'OptionsFlags' : [ 0x0, ['unsigned long']],
    'RequirementsFlags' : [ 0x0, ['unsigned long']],
#    'PoolType' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
    'Frames' : [ 0x8, ['unsigned long']],
    'FrameSize' : [ 0xc, ['unsigned long']],
    'FileAlignment' : [ 0x10, ['unsigned long']],
    'Reserved' : [ 0x14, ['unsigned long']],
} ],
  '_SECURITY_SUBJECT_CONTEXT' : [ 0x10, {
    'ClientToken' : [ 0x0, ['pointer', ['void']]],
#    'ImpersonationLevel' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
    'PrimaryToken' : [ 0x8, ['pointer', ['void']]],
    'ProcessAuditId' : [ 0xc, ['pointer', ['void']]],
} ],
  '_X_FILTER' : [ 0x264, {
    'OpenList' : [ 0x0, ['pointer', ['_X_BINDING_INFO']]],
    'BindListLock' : [ 0x4, ['_NDIS_RW_LOCK']],
    'Miniport' : [ 0x214, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'CombinedPacketFilter' : [ 0x218, ['unsigned long']],
    'OldCombinedPacketFilter' : [ 0x21c, ['unsigned long']],
    'NumOpens' : [ 0x220, ['unsigned long']],
    'MCastSet' : [ 0x224, ['pointer', ['_X_BINDING_INFO']]],
    'SingleActiveOpen' : [ 0x228, ['pointer', ['_X_BINDING_INFO']]],
    'AdapterAddress' : [ 0x22c, ['array', 6, ['unsigned char']]],
    'MCastAddressBuf' : [ 0x234, ['pointer', ['array', 6, ['unsigned char']]]],
    'OldMCastAddressBuf' : [ 0x238, ['pointer', ['array', 6, ['unsigned char']]]],
    'MaxMulticastAddresses' : [ 0x23c, ['unsigned long']],
    'NumAddresses' : [ 0x240, ['unsigned long']],
    'OldNumAddresses' : [ 0x244, ['unsigned long']],
    'AdapterShortAddress' : [ 0x234, ['array', 2, ['unsigned char']]],
    'MCastLongAddressBuf' : [ 0x238, ['pointer', ['array', 6, ['unsigned char']]]],
    'MCastShortAddressBuf' : [ 0x23c, ['pointer', ['array', 2, ['unsigned char']]]],
    'OldMCastLongAddressBuf' : [ 0x240, ['pointer', ['array', 6, ['unsigned char']]]],
    'OldMCastShortAddressBuf' : [ 0x244, ['pointer', ['array', 2, ['unsigned char']]]],
    'MaxMulticastLongAddresses' : [ 0x248, ['unsigned long']],
    'MaxMulticastShortAddresses' : [ 0x24c, ['unsigned long']],
    'NumLongAddresses' : [ 0x250, ['unsigned long']],
    'NumShortAddresses' : [ 0x254, ['unsigned long']],
    'OldNumLongAddresses' : [ 0x258, ['unsigned long']],
    'OldNumShortAddresses' : [ 0x25c, ['unsigned long']],
    'SupportsShortAddresses' : [ 0x260, ['unsigned char']],
    'CombinedFunctionalAddress' : [ 0x234, ['unsigned long']],
    'GroupAddress' : [ 0x238, ['unsigned long']],
    'GroupReferences' : [ 0x23c, ['unsigned long']],
    'OldCombinedFunctionalAddress' : [ 0x240, ['unsigned long']],
    'OldGroupAddress' : [ 0x244, ['unsigned long']],
    'OldGroupReferences' : [ 0x248, ['unsigned long']],
} ],
  '_NDIS51_MINIPORT_CHARACTERISTICS' : [ 0x7c, {
    'MajorNdisVersion' : [ 0x0, ['unsigned char']],
    'MinorNdisVersion' : [ 0x1, ['unsigned char']],
    'Filler' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'CheckForHangHandler' : [ 0x8, ['pointer', ['void']]],
    'DisableInterruptHandler' : [ 0xc, ['pointer', ['void']]],
    'EnableInterruptHandler' : [ 0x10, ['pointer', ['void']]],
    'HaltHandler' : [ 0x14, ['pointer', ['void']]],
    'HandleInterruptHandler' : [ 0x18, ['pointer', ['void']]],
    'InitializeHandler' : [ 0x1c, ['pointer', ['void']]],
    'ISRHandler' : [ 0x20, ['pointer', ['void']]],
    'QueryInformationHandler' : [ 0x24, ['pointer', ['void']]],
    'ReconfigureHandler' : [ 0x28, ['pointer', ['void']]],
    'ResetHandler' : [ 0x2c, ['pointer', ['void']]],
    'SendHandler' : [ 0x30, ['pointer', ['void']]],
    'WanSendHandler' : [ 0x30, ['pointer', ['void']]],
    'SetInformationHandler' : [ 0x34, ['pointer', ['void']]],
    'TransferDataHandler' : [ 0x38, ['pointer', ['void']]],
    'WanTransferDataHandler' : [ 0x38, ['pointer', ['void']]],
    'ReturnPacketHandler' : [ 0x3c, ['pointer', ['void']]],
    'SendPacketsHandler' : [ 0x40, ['pointer', ['void']]],
    'AllocateCompleteHandler' : [ 0x44, ['pointer', ['void']]],
    'CoCreateVcHandler' : [ 0x48, ['pointer', ['void']]],
    'CoDeleteVcHandler' : [ 0x4c, ['pointer', ['void']]],
    'CoActivateVcHandler' : [ 0x50, ['pointer', ['void']]],
    'CoDeactivateVcHandler' : [ 0x54, ['pointer', ['void']]],
    'CoSendPacketsHandler' : [ 0x58, ['pointer', ['void']]],
    'CoRequestHandler' : [ 0x5c, ['pointer', ['void']]],
    'CancelSendPacketsHandler' : [ 0x60, ['pointer', ['void']]],
    'PnPEventNotifyHandler' : [ 0x64, ['pointer', ['void']]],
    'AdapterShutdownHandler' : [ 0x68, ['pointer', ['void']]],
    'Reserved1' : [ 0x6c, ['pointer', ['void']]],
    'Reserved2' : [ 0x70, ['pointer', ['void']]],
    'Reserved3' : [ 0x74, ['pointer', ['void']]],
    'Reserved4' : [ 0x78, ['pointer', ['void']]],
} ],
  '_DATA' : [ 0x14, {
    'QUERY_INFORMATION' : [ 0x0, ['_QUERY_INFORMATION']],
    'SET_INFORMATION' : [ 0x0, ['_SET_INFORMATION']],
} ],
  '_X_BINDING_INFO' : [ 0x40, {
    'NextOpen' : [ 0x0, ['pointer', ['_X_BINDING_INFO']]],
    'NdisBindingHandle' : [ 0x4, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'Reserved' : [ 0x8, ['pointer', ['void']]],
    'PacketFilters' : [ 0xc, ['unsigned long']],
    'OldPacketFilters' : [ 0x10, ['unsigned long']],
    'References' : [ 0x14, ['unsigned long']],
    'NextInactiveOpen' : [ 0x18, ['pointer', ['_X_BINDING_INFO']]],
    'ReceivedAPacket' : [ 0x1c, ['unsigned char']],
    'MCastAddressBuf' : [ 0x20, ['pointer', ['array', 6, ['unsigned char']]]],
    'NumAddresses' : [ 0x24, ['unsigned long']],
    'OldMCastAddressBuf' : [ 0x28, ['pointer', ['array', 6, ['unsigned char']]]],
    'OldNumAddresses' : [ 0x2c, ['unsigned long']],
    'MCastLongAddressBuf' : [ 0x20, ['pointer', ['array', 6, ['unsigned char']]]],
    'NumLongAddresses' : [ 0x24, ['unsigned long']],
    'MCastShortAddressBuf' : [ 0x28, ['pointer', ['array', 2, ['unsigned char']]]],
    'NumShortAddresses' : [ 0x2c, ['unsigned long']],
    'OldMCastLongAddressBuf' : [ 0x30, ['pointer', ['array', 6, ['unsigned char']]]],
    'OldNumLongAddresses' : [ 0x34, ['unsigned long']],
    'OldMCastShortAddressBuf' : [ 0x38, ['pointer', ['array', 2, ['unsigned char']]]],
    'OldNumShortAddresses' : [ 0x3c, ['unsigned long']],
    'FunctionalAddress' : [ 0x20, ['unsigned long']],
    'OldFunctionalAddress' : [ 0x24, ['unsigned long']],
    'UsingGroupAddress' : [ 0x28, ['unsigned char']],
    'OldUsingGroupAddress' : [ 0x29, ['unsigned char']],
} ],
  'KSPIN_DESCRIPTOR' : [ 0x30, {
    'InterfacesCount' : [ 0x0, ['unsigned long']],
    'Interfaces' : [ 0x4, ['pointer', ['KSIDENTIFIER']]],
    'MediumsCount' : [ 0x8, ['unsigned long']],
    'Mediums' : [ 0xc, ['pointer', ['KSIDENTIFIER']]],
    'DataRangesCount' : [ 0x10, ['unsigned long']],
    'DataRanges' : [ 0x14, ['pointer', ['pointer', ['KSDATAFORMAT']]]],
#    'DataFlow' : [ 0x18, [UNIMPLEMENTED LF_ENUM]],
#    'Communication' : [ 0x1c, [UNIMPLEMENTED LF_ENUM]],
    'Category' : [ 0x20, ['pointer', ['_GUID']]],
    'Name' : [ 0x24, ['pointer', ['_GUID']]],
    'Reserved' : [ 0x28, ['long long']],
    'ConstrainedDataRangesCount' : [ 0x28, ['unsigned long']],
    'ConstrainedDataRanges' : [ 0x2c, ['pointer', ['pointer', ['KSDATAFORMAT']]]],
} ],
  '_NDIS_COMMON_OPEN_BLOCK' : [ 0xbc, {
    'MacHandle' : [ 0x0, ['pointer', ['void']]],
    'BindingHandle' : [ 0x4, ['pointer', ['void']]],
    'MiniportHandle' : [ 0x8, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'ProtocolHandle' : [ 0xc, ['pointer', ['_NDIS_PROTOCOL_BLOCK']]],
    'ProtocolBindingContext' : [ 0x10, ['pointer', ['void']]],
    'MiniportNextOpen' : [ 0x14, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'ProtocolNextOpen' : [ 0x18, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'MiniportAdapterContext' : [ 0x1c, ['pointer', ['void']]],
    'Reserved1' : [ 0x20, ['unsigned char']],
    'Reserved2' : [ 0x21, ['unsigned char']],
    'Reserved3' : [ 0x22, ['unsigned char']],
    'Reserved4' : [ 0x23, ['unsigned char']],
    'BindDeviceName' : [ 0x24, ['pointer', ['_UNICODE_STRING']]],
    'Reserved5' : [ 0x28, ['unsigned long']],
    'RootDeviceName' : [ 0x2c, ['pointer', ['_UNICODE_STRING']]],
    'SendHandler' : [ 0x30, ['pointer', ['void']]],
    'WanSendHandler' : [ 0x30, ['pointer', ['void']]],
    'TransferDataHandler' : [ 0x34, ['pointer', ['void']]],
    'SendCompleteHandler' : [ 0x38, ['pointer', ['void']]],
    'TransferDataCompleteHandler' : [ 0x3c, ['pointer', ['void']]],
    'ReceiveHandler' : [ 0x40, ['pointer', ['void']]],
    'ReceiveCompleteHandler' : [ 0x44, ['pointer', ['void']]],
    'WanReceiveHandler' : [ 0x48, ['pointer', ['void']]],
    'RequestCompleteHandler' : [ 0x4c, ['pointer', ['void']]],
    'ReceivePacketHandler' : [ 0x50, ['pointer', ['void']]],
    'SendPacketsHandler' : [ 0x54, ['pointer', ['void']]],
    'ResetHandler' : [ 0x58, ['pointer', ['void']]],
    'RequestHandler' : [ 0x5c, ['pointer', ['void']]],
    'ResetCompleteHandler' : [ 0x60, ['pointer', ['void']]],
    'StatusHandler' : [ 0x64, ['pointer', ['void']]],
    'StatusCompleteHandler' : [ 0x68, ['pointer', ['void']]],
    'Flags' : [ 0x6c, ['unsigned long']],
    'References' : [ 0x70, ['long']],
    'SpinLock' : [ 0x74, ['unsigned long']],
    'FilterHandle' : [ 0x78, ['pointer', ['void']]],
    'ProtocolOptions' : [ 0x7c, ['unsigned long']],
    'CurrentLookahead' : [ 0x80, ['unsigned short']],
    'ConnectDampTicks' : [ 0x82, ['unsigned short']],
    'DisconnectDampTicks' : [ 0x84, ['unsigned short']],
    'WSendHandler' : [ 0x88, ['pointer', ['void']]],
    'WTransferDataHandler' : [ 0x8c, ['pointer', ['void']]],
    'WSendPacketsHandler' : [ 0x90, ['pointer', ['void']]],
    'CancelSendPacketsHandler' : [ 0x94, ['pointer', ['void']]],
    'WakeUpEnable' : [ 0x98, ['unsigned long']],
    'CloseCompleteEvent' : [ 0x9c, ['pointer', ['_KEVENT']]],
    'QC' : [ 0xa0, ['_QUEUED_CLOSE']],
    'AfReferences' : [ 0xb4, ['long']],
    'NextGlobalOpen' : [ 0xb8, ['pointer', ['_NDIS_OPEN_BLOCK']]],
} ],
  '_DMA_ADAPTER' : [ 0x8, {
    'Version' : [ 0x0, ['unsigned short']],
    'Size' : [ 0x2, ['unsigned short']],
    'DmaOperations' : [ 0x4, ['pointer', ['_DMA_OPERATIONS']]],
} ],
  '_DISPATCHER_HEADER' : [ 0x10, {
    'Type' : [ 0x0, ['unsigned char']],
    'Absolute' : [ 0x1, ['unsigned char']],
    'Size' : [ 0x2, ['unsigned char']],
    'Inserted' : [ 0x3, ['unsigned char']],
    'SignalState' : [ 0x4, ['long']],
    'WaitListHead' : [ 0x8, ['_LIST_ENTRY']],
} ],
  '_NDIS_AF_LIST' : [ 0x5c, {
    'NextAf' : [ 0x0, ['pointer', ['_NDIS_AF_LIST']]],
    'Open' : [ 0x4, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'AddressFamily' : [ 0x8, ['CO_ADDRESS_FAMILY']],
    'CmChars' : [ 0x14, ['_NDIS_CALL_MANAGER_CHARACTERISTICS']],
} ],
  '_INITIAL_PRIVILEGE_SET' : [ 0x2c, {
    'PrivilegeCount' : [ 0x0, ['unsigned long']],
    'Control' : [ 0x4, ['unsigned long']],
    'Privilege' : [ 0x8, ['array', 3, ['_LUID_AND_ATTRIBUTES']]],
} ],
  '_NDIS_GUID' : [ 0x1c, {
    'Guid' : [ 0x0, ['_GUID']],
    'Oid' : [ 0x10, ['unsigned long']],
    'Status' : [ 0x10, ['long']],
    'Size' : [ 0x14, ['unsigned long']],
    'Flags' : [ 0x18, ['unsigned long']],
} ],
  '_OBJECT_NAME_INFORMATION' : [ 0x8, {
    'Name' : [ 0x0, ['_UNICODE_STRING']],
} ],
  '_SECURITY_QUALITY_OF_SERVICE' : [ 0xc, {
    'Length' : [ 0x0, ['unsigned long']],
#    'ImpersonationLevel' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
    'ContextTrackingMode' : [ 0x8, ['unsigned char']],
    'EffectiveOnly' : [ 0x9, ['unsigned char']],
} ],
  '_NDIS_ARC_BUF' : [ 0x8c, {
    'ArcnetBufferPool' : [ 0x0, ['pointer', ['void']]],
    'ArcnetLookaheadBuffer' : [ 0x4, ['pointer', ['unsigned char']]],
    'NumFree' : [ 0x8, ['unsigned long']],
    'ArcnetBuffers' : [ 0xc, ['array', 8, ['_ARC_BUFFER_LIST']]],
} ],
  '_NDIS_CALL_MANAGER_CHARACTERISTICS' : [ 0x48, {
    'MajorVersion' : [ 0x0, ['unsigned char']],
    'MinorVersion' : [ 0x1, ['unsigned char']],
    'Filler' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'CmCreateVcHandler' : [ 0x8, ['pointer', ['void']]],
    'CmDeleteVcHandler' : [ 0xc, ['pointer', ['void']]],
    'CmOpenAfHandler' : [ 0x10, ['pointer', ['void']]],
    'CmCloseAfHandler' : [ 0x14, ['pointer', ['void']]],
    'CmRegisterSapHandler' : [ 0x18, ['pointer', ['void']]],
    'CmDeregisterSapHandler' : [ 0x1c, ['pointer', ['void']]],
    'CmMakeCallHandler' : [ 0x20, ['pointer', ['void']]],
    'CmCloseCallHandler' : [ 0x24, ['pointer', ['void']]],
    'CmIncomingCallCompleteHandler' : [ 0x28, ['pointer', ['void']]],
    'CmAddPartyHandler' : [ 0x2c, ['pointer', ['void']]],
    'CmDropPartyHandler' : [ 0x30, ['pointer', ['void']]],
    'CmActivateVcCompleteHandler' : [ 0x34, ['pointer', ['void']]],
    'CmDeactivateVcCompleteHandler' : [ 0x38, ['pointer', ['void']]],
    'CmModifyCallQoSHandler' : [ 0x3c, ['pointer', ['void']]],
    'CmRequestHandler' : [ 0x40, ['pointer', ['void']]],
    'CmRequestCompleteHandler' : [ 0x44, ['pointer', ['void']]],
} ],
  '_DRIVER_OBJECT' : [ 0xa8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'DriverStart' : [ 0xc, ['pointer', ['void']]],
    'DriverSize' : [ 0x10, ['unsigned long']],
    'DriverSection' : [ 0x14, ['pointer', ['void']]],
    'DriverExtension' : [ 0x18, ['pointer', ['_DRIVER_EXTENSION']]],
    'DriverName' : [ 0x1c, ['_UNICODE_STRING']],
    'HardwareDatabase' : [ 0x24, ['pointer', ['_UNICODE_STRING']]],
    'FastIoDispatch' : [ 0x28, ['pointer', ['_FAST_IO_DISPATCH']]],
    'DriverInit' : [ 0x2c, ['pointer', ['void']]],
    'DriverStartIo' : [ 0x30, ['pointer', ['void']]],
    'DriverUnload' : [ 0x34, ['pointer', ['void']]],
    'MajorFunction' : [ 0x38, ['array', 28, ['pointer', ['void']]]],
} ],
  '_DRIVER_EXTENSION' : [ 0x14, {
    'DriverObject' : [ 0x0, ['pointer', ['_DRIVER_OBJECT']]],
    'AddDevice' : [ 0x4, ['pointer', ['void']]],
    'Count' : [ 0x8, ['unsigned long']],
    'ServiceKeyName' : [ 0xc, ['_UNICODE_STRING']],
} ],
  '_NDIS_MINIPORT_INTERRUPT' : [ 0x50, {
    'InterruptObject' : [ 0x0, ['pointer', ['_KINTERRUPT']]],
    'DpcCountLock' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['pointer', ['void']]],
    'MiniportIsr' : [ 0xc, ['pointer', ['void']]],
    'MiniportDpc' : [ 0x10, ['pointer', ['void']]],
    'InterruptDpc' : [ 0x14, ['_KDPC']],
    'Miniport' : [ 0x34, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'DpcCount' : [ 0x38, ['unsigned char']],
    'Filler1' : [ 0x39, ['unsigned char']],
    'DpcsCompletedEvent' : [ 0x3c, ['_KEVENT']],
    'SharedInterrupt' : [ 0x4c, ['unsigned char']],
    'IsrRequested' : [ 0x4d, ['unsigned char']],
} ],
  '_NDIS_MINIPORT_TIMER' : [ 0x58, {
    'Timer' : [ 0x0, ['_KTIMER']],
    'Dpc' : [ 0x28, ['_KDPC']],
    'MiniportTimerFunction' : [ 0x48, ['pointer', ['void']]],
    'MiniportTimerContext' : [ 0x4c, ['pointer', ['void']]],
    'Miniport' : [ 0x50, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'NextTimer' : [ 0x54, ['pointer', ['_NDIS_MINIPORT_TIMER']]],
} ],
  '_IMAGE_DATA_DIRECTORY' : [ 0x8, {
    'VirtualAddress' : [ 0x0, ['unsigned long']],
    'Size' : [ 0x4, ['unsigned long']],
} ],
  '_KSPROCESSPIN_INDEXENTRY' : [ 0x8, {
    'Pins' : [ 0x0, ['pointer', ['pointer', ['_KSPROCESSPIN']]]],
    'Count' : [ 0x4, ['unsigned long']],
} ],
  '_CO_SPECIFIC_PARAMETERS' : [ 0xc, {
    'ParamType' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
    'Parameters' : [ 0x8, ['array', 1, ['unsigned char']]],
} ],
  '_NDIS_TIMER' : [ 0x48, {
    'Timer' : [ 0x0, ['_KTIMER']],
    'Dpc' : [ 0x28, ['_KDPC']],
} ],
  '_QUEUED_CLOSE' : [ 0x14, {
    'Status' : [ 0x0, ['long']],
    'WorkItem' : [ 0x4, ['_WORK_QUEUE_ITEM']],
} ],
  'CO_ADDRESS_FAMILY' : [ 0xc, {
    'AddressFamily' : [ 0x0, ['unsigned long']],
    'MajorVersion' : [ 0x4, ['unsigned long']],
    'MinorVersion' : [ 0x8, ['unsigned long']],
} ],
  'KSRESOLUTION' : [ 0x10, {
    'Granularity' : [ 0x0, ['long long']],
    'Error' : [ 0x8, ['long long']],
} ],
  'KSALLOCATOR_FRAMING_EX' : [ 0x70, {
    'CountItems' : [ 0x0, ['unsigned long']],
    'PinFlags' : [ 0x4, ['unsigned long']],
    'OutputCompression' : [ 0x8, ['KS_COMPRESSION']],
    'PinWeight' : [ 0x14, ['unsigned long']],
    'FramingItem' : [ 0x18, ['array', 1, ['KS_FRAMING_ITEM']]],
} ],
  'KS_FRAMING_ITEM' : [ 0x58, {
    'MemoryType' : [ 0x0, ['_GUID']],
    'BusType' : [ 0x10, ['_GUID']],
    'MemoryFlags' : [ 0x20, ['unsigned long']],
    'BusFlags' : [ 0x24, ['unsigned long']],
    'Flags' : [ 0x28, ['unsigned long']],
    'Frames' : [ 0x2c, ['unsigned long']],
    'FileAlignment' : [ 0x30, ['unsigned long']],
    'MemoryTypeWeight' : [ 0x34, ['unsigned long']],
    'PhysicalRange' : [ 0x38, ['KS_FRAMING_RANGE']],
    'FramingRange' : [ 0x44, ['KS_FRAMING_RANGE_WEIGHTED']],
} ],
  'KS_COMPRESSION' : [ 0xc, {
    'RatioNumerator' : [ 0x0, ['unsigned long']],
    'RatioDenominator' : [ 0x4, ['unsigned long']],
    'RatioConstantMargin' : [ 0x8, ['unsigned long']],
} ],
  'KS_FRAMING_RANGE_WEIGHTED' : [ 0x14, {
    'Range' : [ 0x0, ['KS_FRAMING_RANGE']],
    'InPlaceWeight' : [ 0xc, ['unsigned long']],
    'NotInPlaceWeight' : [ 0x10, ['unsigned long']],
} ],
  'KS_FRAMING_RANGE' : [ 0xc, {
    'MinFrameSize' : [ 0x0, ['unsigned long']],
    'MaxFrameSize' : [ 0x4, ['unsigned long']],
    'Stepping' : [ 0x8, ['unsigned long']],
} ],
  'KSATTRIBUTE_LIST' : [ 0x8, {
    'Count' : [ 0x0, ['unsigned long']],
    'Attributes' : [ 0x4, ['pointer', ['pointer', ['KSATTRIBUTE']]]],
} ],
  'KSATTRIBUTE' : [ 0x18, {
    'Size' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'Attribute' : [ 0x8, ['_GUID']],
} ],
  'KSP_PIN' : [ 0x20, {
    'Property' : [ 0x0, ['KSIDENTIFIER']],
    'PinId' : [ 0x18, ['unsigned long']],
    'Reserved' : [ 0x1c, ['unsigned long']],
} ],
  '_KDEVICE_QUEUE_ENTRY' : [ 0x10, {
    'DeviceListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'SortKey' : [ 0x8, ['unsigned long']],
    'Inserted' : [ 0xc, ['unsigned char']],
} ],
  '_NDIS_RW_LOCK' : [ 0x210, {
    'SpinLock' : [ 0x0, ['unsigned long']],
    'Context' : [ 0x4, ['pointer', ['void']]],
    'Reserved' : [ 0x0, ['array', 16, ['unsigned char']]],
    'RefCount' : [ 0x10, ['array', 32, ['_NDIS_RW_LOCK_REFCOUNT']]],
} ],
  '_NDIS_BIND_PATHS' : [ 0xc, {
    'Number' : [ 0x0, ['unsigned long']],
    'Paths' : [ 0x4, ['array', 1, ['_UNICODE_STRING']]],
} ],
  '_NDIS_RW_LOCK_REFCOUNT' : [ 0x10, {
    'RefCount' : [ 0x0, ['unsigned long']],
    'cacheLine' : [ 0x0, ['array', 16, ['unsigned char']]],
} ],
  '_CM_PARTIAL_RESOURCE_LIST' : [ 0x18, {
    'Version' : [ 0x0, ['unsigned short']],
    'Revision' : [ 0x2, ['unsigned short']],
    'Count' : [ 0x4, ['unsigned long']],
    'PartialDescriptors' : [ 0x8, ['array', 1, ['_CM_PARTIAL_RESOURCE_DESCRIPTOR']]],
} ],
  '_LUID_AND_ATTRIBUTES' : [ 0xc, {
    'Luid' : [ 0x0, ['_LUID']],
    'Attributes' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_148c' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'FileAttributes' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'EaLength' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_148e' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'Key' : [ 0x4, ['unsigned long']],
    'ByteOffset' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1494' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileName' : [ 0x4, ['pointer', ['_STRING']]],
#    'FileInformationClass' : [ 0x8, [UNIMPLEMENTED LF_ENUM]],
    'FileIndex' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_1496' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'CompletionFilter' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_1498' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
#    'FileInformationClass' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
} ],
  '__unnamed_149a' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
#    'FileInformationClass' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
    'FileObject' : [ 0x8, ['pointer', ['_FILE_OBJECT']]],
    'ReplaceIfExists' : [ 0xc, ['unsigned char']],
    'AdvanceOnly' : [ 0xd, ['unsigned char']],
    'ClusterCount' : [ 0xc, ['unsigned long']],
    'DeleteHandle' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_149e' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
#    'FsInformationClass' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
} ],
  '__unnamed_14a0' : [ 0x10, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x4, ['unsigned long']],
    'FsControlCode' : [ 0x8, ['unsigned long']],
    'Type3InputBuffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_14a2' : [ 0x10, {
    'Length' : [ 0x0, ['pointer', ['_LARGE_INTEGER']]],
    'Key' : [ 0x4, ['unsigned long']],
    'ByteOffset' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '__unnamed_14a4' : [ 0x10, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x4, ['unsigned long']],
    'IoControlCode' : [ 0x8, ['unsigned long']],
    'Type3InputBuffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_14a6' : [ 0x8, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_14a8' : [ 0x8, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'SecurityDescriptor' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_14aa' : [ 0x8, {
    'Vpb' : [ 0x0, ['pointer', ['_VPB']]],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
} ],
  '__unnamed_14ae' : [ 0x4, {
    'Srb' : [ 0x0, ['pointer', ['_SCSI_REQUEST_BLOCK']]],
} ],
  '__unnamed_14b2' : [ 0x4, {
#    'Type' : [ 0x0, [UNIMPLEMENTED LF_ENUM]],
} ],
  '__unnamed_14b6' : [ 0x10, {
    'InterfaceType' : [ 0x0, ['pointer', ['_GUID']]],
    'Size' : [ 0x4, ['unsigned short']],
    'Version' : [ 0x6, ['unsigned short']],
    'Interface' : [ 0x8, ['pointer', ['_INTERFACE']]],
    'InterfaceSpecificData' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_14b8' : [ 0x4, {
    'Capabilities' : [ 0x0, ['pointer', ['_DEVICE_CAPABILITIES']]],
} ],
  '__unnamed_14bc' : [ 0x4, {
    'IoResourceRequirementList' : [ 0x0, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
} ],
  '__unnamed_14be' : [ 0x10, {
    'WhichSpace' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x4, ['pointer', ['void']]],
    'Offset' : [ 0x8, ['unsigned long']],
    'Length' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_14c0' : [ 0x1, {
    'Lock' : [ 0x0, ['unsigned char']],
} ],
  '__unnamed_14c4' : [ 0x4, {
#    'IdType' : [ 0x0, [UNIMPLEMENTED LF_ENUM]],
} ],
  '__unnamed_14c8' : [ 0x8, {
#    'DeviceTextType' : [ 0x0, [UNIMPLEMENTED LF_ENUM]],
    'LocaleId' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_14cd' : [ 0x8, {
    'InPath' : [ 0x0, ['unsigned char']],
    'Reserved' : [ 0x1, ['array', 3, ['unsigned char']]],
#    'Type' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
} ],
  '__unnamed_14cf' : [ 0x4, {
#    'PowerState' : [ 0x0, [UNIMPLEMENTED LF_ENUM]],
} ],
  '__unnamed_14d3' : [ 0x4, {
    'PowerSequence' : [ 0x0, ['pointer', ['_POWER_SEQUENCE']]],
} ],
  '__unnamed_14d8' : [ 0x10, {
    'SystemContext' : [ 0x0, ['unsigned long']],
#    'Type' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
    'State' : [ 0x8, ['_POWER_STATE']],
#    'ShutdownType' : [ 0xc, [UNIMPLEMENTED LF_ENUM]],
} ],
  '__unnamed_14da' : [ 0x8, {
    'AllocatedResources' : [ 0x0, ['pointer', ['_CM_RESOURCE_LIST']]],
    'AllocatedResourcesTranslated' : [ 0x4, ['pointer', ['_CM_RESOURCE_LIST']]],
} ],
  '__unnamed_14dc' : [ 0x10, {
    'ProviderId' : [ 0x0, ['unsigned long']],
    'DataPath' : [ 0x4, ['pointer', ['void']]],
    'BufferSize' : [ 0x8, ['unsigned long']],
    'Buffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_14de' : [ 0x10, {
    'Argument1' : [ 0x0, ['pointer', ['void']]],
    'Argument2' : [ 0x4, ['pointer', ['void']]],
    'Argument3' : [ 0x8, ['pointer', ['void']]],
    'Argument4' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_14e0' : [ 0x10, {
    'Create' : [ 0x0, ['__unnamed_148c']],
    'Read' : [ 0x0, ['__unnamed_148e']],
    'Write' : [ 0x0, ['__unnamed_148e']],
    'QueryDirectory' : [ 0x0, ['__unnamed_1494']],
    'NotifyDirectory' : [ 0x0, ['__unnamed_1496']],
    'QueryFile' : [ 0x0, ['__unnamed_1498']],
    'SetFile' : [ 0x0, ['__unnamed_149a']],
    'QueryVolume' : [ 0x0, ['__unnamed_149e']],
    'FileSystemControl' : [ 0x0, ['__unnamed_14a0']],
    'LockControl' : [ 0x0, ['__unnamed_14a2']],
    'DeviceIoControl' : [ 0x0, ['__unnamed_14a4']],
    'QuerySecurity' : [ 0x0, ['__unnamed_14a6']],
    'SetSecurity' : [ 0x0, ['__unnamed_14a8']],
    'MountVolume' : [ 0x0, ['__unnamed_14aa']],
    'VerifyVolume' : [ 0x0, ['__unnamed_14aa']],
    'Scsi' : [ 0x0, ['__unnamed_14ae']],
    'QueryDeviceRelations' : [ 0x0, ['__unnamed_14b2']],
    'QueryInterface' : [ 0x0, ['__unnamed_14b6']],
    'DeviceCapabilities' : [ 0x0, ['__unnamed_14b8']],
    'FilterResourceRequirements' : [ 0x0, ['__unnamed_14bc']],
    'ReadWriteConfig' : [ 0x0, ['__unnamed_14be']],
    'SetLock' : [ 0x0, ['__unnamed_14c0']],
    'QueryId' : [ 0x0, ['__unnamed_14c4']],
    'QueryDeviceText' : [ 0x0, ['__unnamed_14c8']],
    'UsageNotification' : [ 0x0, ['__unnamed_14cd']],
    'WaitWake' : [ 0x0, ['__unnamed_14cf']],
    'PowerSequence' : [ 0x0, ['__unnamed_14d3']],
    'Power' : [ 0x0, ['__unnamed_14d8']],
    'StartDevice' : [ 0x0, ['__unnamed_14da']],
    'WMI' : [ 0x0, ['__unnamed_14dc']],
    'Others' : [ 0x0, ['__unnamed_14de']],
} ],
  '_IO_STACK_LOCATION' : [ 0x24, {
    'MajorFunction' : [ 0x0, ['unsigned char']],
    'MinorFunction' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned char']],
    'Control' : [ 0x3, ['unsigned char']],
    'Parameters' : [ 0x4, ['__unnamed_14e0']],
    'DeviceObject' : [ 0x14, ['pointer', ['_DEVICE_OBJECT']]],
    'FileObject' : [ 0x18, ['pointer', ['_FILE_OBJECT']]],
    'CompletionRoutine' : [ 0x1c, ['pointer', ['void']]],
    'Context' : [ 0x20, ['pointer', ['void']]],
} ],
  '_INTERFACE' : [ 0x10, {
    'Size' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned short']],
    'Context' : [ 0x4, ['pointer', ['void']]],
    'InterfaceReference' : [ 0x8, ['pointer', ['void']]],
    'InterfaceDereference' : [ 0xc, ['pointer', ['void']]],
} ],
  '_ARC_FILTER' : [ 0x24, {
    'Miniport' : [ 0x0, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'CombinedPacketFilter' : [ 0x4, ['unsigned long']],
    'OpenList' : [ 0x8, ['pointer', ['_ARC_BINDING_INFO']]],
    'ReceiveBufferPool' : [ 0xc, ['pointer', ['void']]],
    'FreeBufferList' : [ 0x10, ['pointer', ['_ARC_BUFFER_LIST']]],
    'FreePackets' : [ 0x14, ['pointer', ['_ARC_PACKET']]],
    'OutstandingPackets' : [ 0x18, ['pointer', ['_ARC_PACKET']]],
    'AdapterAddress' : [ 0x1c, ['unsigned char']],
    'OldCombinedPacketFilter' : [ 0x20, ['unsigned long']],
} ],
  '_OID_LIST' : [ 0x10, {
    'StatsOidCount' : [ 0x0, ['unsigned long']],
    'FullOidCount' : [ 0x4, ['unsigned long']],
    'StatsOidArray' : [ 0x8, ['pointer', ['unsigned long']]],
    'FullOidArray' : [ 0xc, ['pointer', ['unsigned long']]],
} ],
  '_flowspec' : [ 0x20, {
    'TokenRate' : [ 0x0, ['unsigned long']],
    'TokenBucketSize' : [ 0x4, ['unsigned long']],
    'PeakBandwidth' : [ 0x8, ['unsigned long']],
    'Latency' : [ 0xc, ['unsigned long']],
    'DelayVariation' : [ 0x10, ['unsigned long']],
    'ServiceType' : [ 0x14, ['unsigned long']],
    'MaxSduSize' : [ 0x18, ['unsigned long']],
    'MinimumPolicedSize' : [ 0x1c, ['unsigned long']],
} ],
  '_POWER_STATE' : [ 0x4, {
#    'SystemState' : [ 0x0, [UNIMPLEMENTED LF_ENUM]],
#    'DeviceState' : [ 0x0, [UNIMPLEMENTED LF_ENUM]],
} ],
  '_NDIS_PNP_CAPABILITIES' : [ 0x10, {
    'Flags' : [ 0x0, ['unsigned long']],
    'WakeUpCapabilities' : [ 0x4, ['_NDIS_PM_WAKE_UP_CAPABILITIES']],
} ],
  '_KSPROCESSPIN' : [ 0x28, {
    'Pin' : [ 0x0, ['pointer', ['_KSPIN']]],
    'StreamPointer' : [ 0x4, ['pointer', ['_KSSTREAM_POINTER']]],
    'InPlaceCounterpart' : [ 0x8, ['pointer', ['_KSPROCESSPIN']]],
    'DelegateBranch' : [ 0xc, ['pointer', ['_KSPROCESSPIN']]],
    'CopySource' : [ 0x10, ['pointer', ['_KSPROCESSPIN']]],
    'Data' : [ 0x14, ['pointer', ['void']]],
    'BytesAvailable' : [ 0x18, ['unsigned long']],
    'BytesUsed' : [ 0x1c, ['unsigned long']],
    'Flags' : [ 0x20, ['unsigned long']],
    'Terminate' : [ 0x24, ['unsigned char']],
} ],
  '_NDIS_EVENT' : [ 0x10, {
    'Event' : [ 0x0, ['_KEVENT']],
} ],
  '_IO_RESOURCE_REQUIREMENTS_LIST' : [ 0x48, {
    'ListSize' : [ 0x0, ['unsigned long']],
#    'InterfaceType' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'SlotNumber' : [ 0xc, ['unsigned long']],
    'Reserved' : [ 0x10, ['array', 3, ['unsigned long']]],
    'AlternativeLists' : [ 0x1c, ['unsigned long']],
    'List' : [ 0x20, ['array', 1, ['_IO_RESOURCE_LIST']]],
} ],
  '_STRING' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x4, ['pointer', ['unsigned char']]],
} ],
  '_KSSTREAM_POINTER' : [ 0x30, {
    'Context' : [ 0x0, ['pointer', ['void']]],
    'Pin' : [ 0x4, ['pointer', ['_KSPIN']]],
    'StreamHeader' : [ 0x8, ['pointer', ['KSSTREAM_HEADER']]],
    'Offset' : [ 0xc, ['pointer', ['_KSSTREAM_POINTER_OFFSET']]],
    'OffsetIn' : [ 0x10, ['_KSSTREAM_POINTER_OFFSET']],
    'OffsetOut' : [ 0x20, ['_KSSTREAM_POINTER_OFFSET']],
} ],
  'KSSTREAM_HEADER' : [ 0x30, {
    'Size' : [ 0x0, ['unsigned long']],
    'TypeSpecificFlags' : [ 0x4, ['unsigned long']],
    'PresentationTime' : [ 0x8, ['KSTIME']],
    'Duration' : [ 0x18, ['long long']],
    'FrameExtent' : [ 0x20, ['unsigned long']],
    'DataUsed' : [ 0x24, ['unsigned long']],
    'Data' : [ 0x28, ['pointer', ['void']]],
    'OptionsFlags' : [ 0x2c, ['unsigned long']],
} ],
  '_KTIMER' : [ 0x28, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'DueTime' : [ 0x10, ['_ULARGE_INTEGER']],
    'TimerListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'Dpc' : [ 0x20, ['pointer', ['_KDPC']]],
    'Period' : [ 0x24, ['long']],
} ],
  '_NDIS_LOG' : [ 0x20, {
    'Miniport' : [ 0x0, ['pointer', ['_NDIS_MINIPORT_BLOCK']]],
    'LogLock' : [ 0x4, ['unsigned long']],
    'Irp' : [ 0x8, ['pointer', ['_IRP']]],
    'TotalSize' : [ 0xc, ['unsigned long']],
    'CurrentSize' : [ 0x10, ['unsigned long']],
    'InPtr' : [ 0x14, ['unsigned long']],
    'OutPtr' : [ 0x18, ['unsigned long']],
    'LogBuf' : [ 0x1c, ['array', 1, ['unsigned char']]],
} ],
  '_FAST_IO_DISPATCH' : [ 0x70, {
    'SizeOfFastIoDispatch' : [ 0x0, ['unsigned long']],
    'FastIoCheckIfPossible' : [ 0x4, ['pointer', ['void']]],
    'FastIoRead' : [ 0x8, ['pointer', ['void']]],
    'FastIoWrite' : [ 0xc, ['pointer', ['void']]],
    'FastIoQueryBasicInfo' : [ 0x10, ['pointer', ['void']]],
    'FastIoQueryStandardInfo' : [ 0x14, ['pointer', ['void']]],
    'FastIoLock' : [ 0x18, ['pointer', ['void']]],
    'FastIoUnlockSingle' : [ 0x1c, ['pointer', ['void']]],
    'FastIoUnlockAll' : [ 0x20, ['pointer', ['void']]],
    'FastIoUnlockAllByKey' : [ 0x24, ['pointer', ['void']]],
    'FastIoDeviceControl' : [ 0x28, ['pointer', ['void']]],
    'AcquireFileForNtCreateSection' : [ 0x2c, ['pointer', ['void']]],
    'ReleaseFileForNtCreateSection' : [ 0x30, ['pointer', ['void']]],
    'FastIoDetachDevice' : [ 0x34, ['pointer', ['void']]],
    'FastIoQueryNetworkOpenInfo' : [ 0x38, ['pointer', ['void']]],
    'AcquireForModWrite' : [ 0x3c, ['pointer', ['void']]],
    'MdlRead' : [ 0x40, ['pointer', ['void']]],
    'MdlReadComplete' : [ 0x44, ['pointer', ['void']]],
    'PrepareMdlWrite' : [ 0x48, ['pointer', ['void']]],
    'MdlWriteComplete' : [ 0x4c, ['pointer', ['void']]],
    'FastIoReadCompressed' : [ 0x50, ['pointer', ['void']]],
    'FastIoWriteCompressed' : [ 0x54, ['pointer', ['void']]],
    'MdlReadCompleteCompressed' : [ 0x58, ['pointer', ['void']]],
    'MdlWriteCompleteCompressed' : [ 0x5c, ['pointer', ['void']]],
    'FastIoQueryOpen' : [ 0x60, ['pointer', ['void']]],
    'ReleaseForModWrite' : [ 0x64, ['pointer', ['void']]],
    'AcquireForCcFlush' : [ 0x68, ['pointer', ['void']]],
    'ReleaseForCcFlush' : [ 0x6c, ['pointer', ['void']]],
} ],
  '_FILE_BASIC_INFORMATION' : [ 0x28, {
    'CreationTime' : [ 0x0, ['_LARGE_INTEGER']],
    'LastAccessTime' : [ 0x8, ['_LARGE_INTEGER']],
    'LastWriteTime' : [ 0x10, ['_LARGE_INTEGER']],
    'ChangeTime' : [ 0x18, ['_LARGE_INTEGER']],
    'FileAttributes' : [ 0x20, ['unsigned long']],
} ],
  '_PRIVILEGE_SET' : [ 0x14, {
    'PrivilegeCount' : [ 0x0, ['unsigned long']],
    'Control' : [ 0x4, ['unsigned long']],
    'Privilege' : [ 0x8, ['array', 1, ['_LUID_AND_ATTRIBUTES']]],
} ],
  '_IO_SECURITY_CONTEXT' : [ 0x10, {
    'SecurityQos' : [ 0x0, ['pointer', ['_SECURITY_QUALITY_OF_SERVICE']]],
    'AccessState' : [ 0x4, ['pointer', ['_ACCESS_STATE']]],
    'DesiredAccess' : [ 0x8, ['unsigned long']],
    'FullCreateOptions' : [ 0xc, ['unsigned long']],
} ],
  '_QUERY_INFORMATION' : [ 0x14, {
    'Oid' : [ 0x0, ['unsigned long']],
    'InformationBuffer' : [ 0x4, ['pointer', ['void']]],
    'InformationBufferLength' : [ 0x8, ['unsigned long']],
    'BytesWritten' : [ 0xc, ['unsigned long']],
    'BytesNeeded' : [ 0x10, ['unsigned long']],
} ],
  '_SET_INFORMATION' : [ 0x14, {
    'Oid' : [ 0x0, ['unsigned long']],
    'InformationBuffer' : [ 0x4, ['pointer', ['void']]],
    'InformationBufferLength' : [ 0x8, ['unsigned long']],
    'BytesRead' : [ 0xc, ['unsigned long']],
    'BytesNeeded' : [ 0x10, ['unsigned long']],
} ],
  '_KSSTREAM_POINTER_OFFSET' : [ 0x10, {
    'Data' : [ 0x0, ['pointer', ['unsigned char']]],
    'Mappings' : [ 0x0, ['pointer', ['_KSMAPPING']]],
    'Alignment' : [ 0x4, ['pointer', ['void']]],
    'Count' : [ 0x8, ['unsigned long']],
    'Remaining' : [ 0xc, ['unsigned long']],
} ],
  '_ARC_BUFFER_LIST' : [ 0x10, {
    'Buffer' : [ 0x0, ['pointer', ['void']]],
    'Size' : [ 0x4, ['unsigned long']],
    'BytesLeft' : [ 0x8, ['unsigned long']],
    'Next' : [ 0xc, ['pointer', ['_ARC_BUFFER_LIST']]],
} ],
  '_IO_RESOURCE_LIST' : [ 0x28, {
    'Version' : [ 0x0, ['unsigned short']],
    'Revision' : [ 0x2, ['unsigned short']],
    'Count' : [ 0x4, ['unsigned long']],
    'Descriptors' : [ 0x8, ['array', 1, ['_IO_RESOURCE_DESCRIPTOR']]],
} ],
  '_ARC_BINDING_INFO' : [ 0x1c, {
    'NdisBindingHandle' : [ 0x0, ['pointer', ['_NDIS_OPEN_BLOCK']]],
    'Reserved' : [ 0x4, ['pointer', ['void']]],
    'PacketFilters' : [ 0x8, ['unsigned long']],
    'References' : [ 0xc, ['unsigned long']],
    'NextOpen' : [ 0x10, ['pointer', ['_ARC_BINDING_INFO']]],
    'ReceivedAPacket' : [ 0x14, ['unsigned char']],
    'OldPacketFilters' : [ 0x18, ['unsigned long']],
} ],
  '_FILE_NETWORK_OPEN_INFORMATION' : [ 0x38, {
    'CreationTime' : [ 0x0, ['_LARGE_INTEGER']],
    'LastAccessTime' : [ 0x8, ['_LARGE_INTEGER']],
    'LastWriteTime' : [ 0x10, ['_LARGE_INTEGER']],
    'ChangeTime' : [ 0x18, ['_LARGE_INTEGER']],
    'AllocationSize' : [ 0x20, ['_LARGE_INTEGER']],
    'EndOfFile' : [ 0x28, ['_LARGE_INTEGER']],
    'FileAttributes' : [ 0x30, ['unsigned long']],
} ],
  '_NDIS_PM_WAKE_UP_CAPABILITIES' : [ 0xc, {
#    'MinMagicPacketWakeUp' : [ 0x0, [UNIMPLEMENTED LF_ENUM]],
#    'MinPatternWakeUp' : [ 0x4, [UNIMPLEMENTED LF_ENUM]],
#    'MinLinkChangeWakeUp' : [ 0x8, [UNIMPLEMENTED LF_ENUM]],
} ],
  '_KSMAPPING' : [ 0x10, {
    'PhysicalAddress' : [ 0x0, ['_LARGE_INTEGER']],
    'ByteCount' : [ 0x8, ['unsigned long']],
    'Alignment' : [ 0xc, ['unsigned long']],
} ],
  '_POWER_SEQUENCE' : [ 0xc, {
    'SequenceD1' : [ 0x0, ['unsigned long']],
    'SequenceD2' : [ 0x4, ['unsigned long']],
    'SequenceD3' : [ 0x8, ['unsigned long']],
} ],
  '_DMA_OPERATIONS' : [ 0x40, {
    'Size' : [ 0x0, ['unsigned long']],
    'PutDmaAdapter' : [ 0x4, ['pointer', ['void']]],
    'AllocateCommonBuffer' : [ 0x8, ['pointer', ['void']]],
    'FreeCommonBuffer' : [ 0xc, ['pointer', ['void']]],
    'AllocateAdapterChannel' : [ 0x10, ['pointer', ['void']]],
    'FlushAdapterBuffers' : [ 0x14, ['pointer', ['void']]],
    'FreeAdapterChannel' : [ 0x18, ['pointer', ['void']]],
    'FreeMapRegisters' : [ 0x1c, ['pointer', ['void']]],
    'MapTransfer' : [ 0x20, ['pointer', ['void']]],
    'GetDmaAlignment' : [ 0x24, ['pointer', ['void']]],
    'ReadDmaCounter' : [ 0x28, ['pointer', ['void']]],
    'GetScatterGatherList' : [ 0x2c, ['pointer', ['void']]],
    'PutScatterGatherList' : [ 0x30, ['pointer', ['void']]],
    'CalculateScatterGatherList' : [ 0x34, ['pointer', ['void']]],
    'BuildScatterGatherList' : [ 0x38, ['pointer', ['void']]],
    'BuildMdlFromScatterGatherList' : [ 0x3c, ['pointer', ['void']]],
} ],
  '__unnamed_15a8' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'Alignment' : [ 0x4, ['unsigned long']],
    'MinimumAddress' : [ 0x8, ['_LARGE_INTEGER']],
    'MaximumAddress' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_15aa' : [ 0x8, {
    'MinimumVector' : [ 0x0, ['unsigned long']],
    'MaximumVector' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_15ac' : [ 0x8, {
    'MinimumChannel' : [ 0x0, ['unsigned long']],
    'MaximumChannel' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_15ae' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'MinBusNumber' : [ 0x4, ['unsigned long']],
    'MaxBusNumber' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_15b0' : [ 0xc, {
    'Priority' : [ 0x0, ['unsigned long']],
    'Reserved1' : [ 0x4, ['unsigned long']],
    'Reserved2' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_15b2' : [ 0x18, {
    'Port' : [ 0x0, ['__unnamed_15a8']],
    'Memory' : [ 0x0, ['__unnamed_15a8']],
    'Interrupt' : [ 0x0, ['__unnamed_15aa']],
    'Dma' : [ 0x0, ['__unnamed_15ac']],
    'Generic' : [ 0x0, ['__unnamed_15a8']],
    'DevicePrivate' : [ 0x0, ['__unnamed_11a0']],
    'BusNumber' : [ 0x0, ['__unnamed_15ae']],
    'ConfigData' : [ 0x0, ['__unnamed_15b0']],
} ],
  '_IO_RESOURCE_DESCRIPTOR' : [ 0x20, {
    'Option' : [ 0x0, ['unsigned char']],
    'Type' : [ 0x1, ['unsigned char']],
    'ShareDisposition' : [ 0x2, ['unsigned char']],
    'Spare1' : [ 0x3, ['unsigned char']],
    'Flags' : [ 0x4, ['unsigned short']],
    'Spare2' : [ 0x6, ['unsigned short']],
    'u' : [ 0x8, ['__unnamed_15b2']],
} ],
  '_ARC_PACKET' : [ 0x5c, {
    'Header' : [ 0x0, ['_ARC_PACKET_HEADER']],
    'Next' : [ 0xc, ['pointer', ['_ARC_PACKET']]],
    'TotalLength' : [ 0x10, ['unsigned long']],
    'LastFrame' : [ 0x14, ['unsigned char']],
    'FirstBuffer' : [ 0x18, ['pointer', ['_ARC_BUFFER_LIST']]],
    'LastBuffer' : [ 0x1c, ['pointer', ['_ARC_BUFFER_LIST']]],
    'TmpNdisPacket' : [ 0x20, ['_NDIS_PACKET']],
} ],
  '_COMPRESSED_DATA_INFO' : [ 0xc, {
    'CompressionFormatAndEngine' : [ 0x0, ['unsigned short']],
    'CompressionUnitShift' : [ 0x2, ['unsigned char']],
    'ChunkShift' : [ 0x3, ['unsigned char']],
    'ClusterShift' : [ 0x4, ['unsigned char']],
    'Reserved' : [ 0x5, ['unsigned char']],
    'NumberOfChunks' : [ 0x6, ['unsigned short']],
    'CompressedChunkSizes' : [ 0x8, ['array', 1, ['unsigned long']]],
} ],
  '_FILE_STANDARD_INFORMATION' : [ 0x18, {
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
    'EndOfFile' : [ 0x8, ['_LARGE_INTEGER']],
    'NumberOfLinks' : [ 0x10, ['unsigned long']],
    'DeletePending' : [ 0x14, ['unsigned char']],
    'Directory' : [ 0x15, ['unsigned char']],
} ],
  'KSTIME' : [ 0x10, {
    'Time' : [ 0x0, ['long long']],
    'Numerator' : [ 0x8, ['unsigned long']],
    'Denominator' : [ 0xc, ['unsigned long']],
} ],
  '_SCATTER_GATHER_LIST' : [ 0x8, {
    'NumberOfElements' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Elements' : [ 0x8, ['array', 0, ['_SCATTER_GATHER_ELEMENT']]],
} ],
  '_ARC_PACKET_HEADER' : [ 0xa, {
    'ProtHeader' : [ 0x0, ['_ARC_PROTOCOL_HEADER']],
    'FrameSequence' : [ 0x4, ['unsigned short']],
    'SplitFlag' : [ 0x6, ['unsigned char']],
    'LastSplitFlag' : [ 0x7, ['unsigned char']],
    'FramesReceived' : [ 0x8, ['unsigned char']],
} ],
  '_SCATTER_GATHER_ELEMENT' : [ 0x10, {
    'Address' : [ 0x0, ['_LARGE_INTEGER']],
    'Length' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
} ],
  '_ARC_PROTOCOL_HEADER' : [ 0x3, {
    'SourceId' : [ 0x0, ['array', 1, ['unsigned char']]],
    'DestId' : [ 0x1, ['array', 1, ['unsigned char']]],
    'ProtId' : [ 0x2, ['unsigned char']],
} ],
}
